[
    {
        "name": "upcoming_concert",
        "goal": "Find an upcoming concert in New York City featuring a popular artist or band in June 2023, and provide details about the event, including the venue and date.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "best_laptop",
        "goal": "Identify the best-rated laptop with a budget under $1000 as of April 2023. Mention the laptop model, its specifications, and price.",
        "max_similarity_score": 0.21621621621621623
    },
    {
        "name": "new_releases_books",
        "goal": "What are the top 3 newly released books in the mystery/thriller genre? List the book titles and authors.",
        "max_similarity_score": 0.31999999999999995
    },
    {
        "name": "electric_car_range",
        "goal": "What is the electric car with the longest range and what is the estimated range in miles?",
        "max_similarity_score": 0.37037037037037035
    },
    {
        "name": "job_opportunities",
        "goal": "Locate 3 job opportunities for a software engineer with 3 years of experience in San Francisco. Include the company name and a brief job description.",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "space_news",
        "goal": "What is the latest news regarding SpaceX's Starship development and testing?",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "gas_prices",
        "goal": "What is the current average price of gasoline in the United States?",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "upcoming_auctions",
        "goal": "Find an upcoming art auction in London showcasing renowned artists' work. Provide the auction event name, date, and location.",
        "max_similarity_score": 0.3404255319148936
    },
    {
        "name": "celebrity_engagement",
        "goal": "Which celebrity couple recently announced their engagement?",
        "max_similarity_score": 0.13333333333333333
    },
    {
        "name": "forex_rates",
        "goal": "What is the current exchange rate for GBP to USD?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "startup_interest",
        "goal": "Identify an innovative startup with a focus on renewable energy that has attracted significant investor interest.",
        "max_similarity_score": 0.16
    },
    {
        "name": "marathon_event",
        "goal": "Find the date and location of the upcoming Boston Marathon event in 2023.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "influential_politician",
        "goal": "Identify a politician who has recently gained significant influence and media attention. Provide their name and the reason for their prominence.",
        "max_similarity_score": 0.2162162162162162
    },
    {
        "name": "recipe_finding",
        "goal": "Discover a popular and easy-to-make recipe for chocolate chip cookies. List the ingredients and steps required.",
        "max_similarity_score": 0.21739130434782608
    },
    {
        "name": "university_ranking",
        "goal": "What is the current ranking of Harvard University in the global university rankings list of 2023?",
        "max_similarity_score": 0.5
    },
    {
        "name": "stock_splits",
        "goal": "Find information about a recent stock split at most three, and provide the stock's name, split ratio, and date.",
        "max_similarity_score": 0.2916666666666667
    },
    {
        "name": "climate_change",
        "goal": "What is the latest development in global efforts to combat climate change?",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "sustainable_fashion",
        "goal": "Identify a popular sustainable fashion brand and describe its eco-friendly practices.",
        "max_similarity_score": 0.2
    },
    {
        "name": "allergy_alert",
        "goal": "What is the current pollen count and allergy alert level in New York City?",
        "max_similarity_score": 0.5
    },
    {
        "name": "real_estate_listing",
        "goal": "Find a recently listed 3-bedroom house for sale in Los Angeles, California, within a budget of $1 million. Provide the address and listing price.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "rare_coins",
        "goal": "Identify a rare coin auction featuring high-value items taking place in 2023. Specify the event name, date, and location.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "tech_product_release",
        "goal": "What is the recently announced upcoming release date for Apple's latest iPhone?",
        "max_similarity_score": 0.3571428571428571
    },
    {
        "name": "world_records",
        "goal": "Which world record was recently broken, and who is the new record holder? Provide the event and the record details.",
        "max_similarity_score": 0.2941176470588235
    },
    {
        "name": "automobile_recall",
        "goal": "Find information about a recently issued automobile recall. Include the make and model affected and the reason for the recall.",
        "max_similarity_score": 0.3414634146341463
    },
    {
        "name": "theater_ticket_sales",
        "goal": "What Broadway show has the highest ticket sales in April 2023?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "virtual_reality",
        "goal": "Identify a breakthrough in virtual reality technology and describe its potential applications and impacts.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "olympics_medal_count",
        "goal": "What country has the highest medal count in the 2023 Winter Olympic Games?",
        "max_similarity_score": 0.4999999999999999
    },
    {
        "name": "wildlife_conservation",
        "goal": "What major wildlife conservation project is currently underway? Provide a brief summary of the project's goals and methods.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "renewable_energy_record",
        "goal": "Which country recently achieved a significant milestone in renewable energy production?",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "restaurant_openings",
        "goal": "Find a highly anticipated restaurant opening in Chicago in May 2023. Provide the restaurant's name and its cuisine.",
        "max_similarity_score": 0.358974358974359
    },
    {
        "name": "vaccine_development",
        "goal": "What is the latest news on the development of a new vaccine for an emerging disease?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "new_gadget",
        "goal": "What is a recently released unique gadget or tech product that is gaining popularity? Provide the gadget's name and its primary function.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "film_festival",
        "goal": "Identify an upcoming film festival in 2023 and provide the event's name, location, and dates.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "architecture_award",
        "goal": "Which building recently won a prestigious architecture award and what makes it special?",
        "max_similarity_score": 0.24999999999999994
    },
    {
        "name": "endangered_species",
        "goal": "What endangered species was recently reported to have its population rebound thanks to conservation efforts?",
        "max_similarity_score": 0.16
    },
    {
        "name": "scientific_discovery",
        "goal": "What is a recent groundbreaking scientific discovery, and how could it potentially impact our lives?",
        "max_similarity_score": 0.24
    },
    {
        "name": "merger_announcement",
        "goal": "Identify a significant merger or acquisition that was recently announced. Provide the companies involved and a brief summary of the deal.",
        "max_similarity_score": 0.35
    },
    {
        "name": "upcoming_election",
        "goal": "When is the next scheduled United States presidential election, and who are the main contenders?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "music_awards",
        "goal": "Who won the Album of the Year award at the latest Grammy Awards ceremony?",
        "max_similarity_score": 0.32
    },
    {
        "name": "plant_care",
        "goal": "Find a popular houseplant that requires minimal maintenance. Provide the name of the plant and some basic care tips.",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "cryptocurrency_prices",
        "goal": "What are the current prices of Bitcoin and Ethereum?",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "popular_app",
        "goal": "What is a recently popularized mobile app, and what is its main purpose?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "solar_eclipse",
        "goal": "When and where will the next total solar eclipse be visible?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "medication_recall",
        "goal": "Identify a recent medication recall and provide the name of the medication and the reason for the recall.",
        "max_similarity_score": 0.4736842105263158
    },
    {
        "name": "financial_market_update",
        "goal": "What is the latest major development or news in the financial markets?",
        "max_similarity_score": 0.5
    },
    {
        "name": "fitness_challenge",
        "goal": "Find a popular online fitness challenge for people looking to stay active during a 30-day period. Provide the challenge's name and a brief overview.",
        "max_similarity_score": 0.3111111111111111
    },
    {
        "name": "new_legislation",
        "goal": "What new law or regulation was recently passed in the United States, and how might it affect citizens?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "space_mission",
        "goal": "What is the next planned space mission by SpaceX? Include the mission name, objective, and launch date.",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "tech_stock_review",
        "goal": "Which tech companies have recently seen a significant increase in their stock prices? List the top 3 companies with the highest percentage gain.",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "covid_update",
        "goal": "What were the latest updates on COVID-19 vaccine approvals or breakthroughs?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "nobel_winner",
        "goal": "Who won the most recent Nobel Prize in Physics? Include the scientist's name and their contribution.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "fifa_player",
        "goal": "Who is the current FIFA Men's Player of the Year? Provide the player's name, team, and position.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "prime_minister",
        "goal": "Investigate who recently became the Prime Minister of Australia?",
        "max_similarity_score": 0.3
    },
    {
        "name": "movie_release",
        "goal": "List the top three highest-grossing movies released in the past year.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "earthquake_report",
        "goal": "Has there been a significant earthquake (magnitude 6.0 or above) in the last 30 days? If yes, provide the location and magnitude.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "tropical_storm",
        "goal": "Is there an active tropical storm being monitored by weather services? If yes, provide the storm's name and current status.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "endangered_species",
        "goal": "Identify a recently declared endangered species. Provide the species' name and a brief description of the reason for its endangered status.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "climate_change_event",
        "goal": "What is an upcoming event centered around climate change? Include the event name, date, and location.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "investment_news",
        "goal": "What are the three most notable investment deals in the tech industry from the past month?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "burger_chain_expansion",
        "goal": "Which fast-food chain specializing in burgers has recently announced its international expansion plans? Include the chain's name and target countries.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "gaming_industry_news",
        "goal": "What is the biggest news in the gaming industry from the last week? Provide the headline and a brief summary.",
        "max_similarity_score": 0.38888888888888884
    },
    {
        "name": "green_energy_projects",
        "goal": "Name a newly announced green energy project. Include the project's name, location, and aim.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "recent_art_auction",
        "goal": "What is the most expensive artwork sold at auction in the past month? Provide the artwork's name, artist, and sale price.",
        "max_similarity_score": 0.3902439024390244
    },
    {
        "name": "fashion_week_update",
        "goal": "Which major fashion week event is occurring next? Include the event name, city, and dates.",
        "max_similarity_score": 0.38709677419354843
    },
    {
        "name": "world_record_breaker",
        "goal": "Has any world record been broken in the last week? If yes, provide the record, the name of the person who broke it, and the new record.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "photography_award",
        "goal": "Who is the most recent winner of the World Press Photo Award? Include the photographer's name, the photo's subject, and a brief description of the photo.",
        "max_similarity_score": 0.4482758620689655
    },
    {
        "name": "theater_premiere",
        "goal": "What is the next highly anticipated theater production premiering in New York City? Provide the production name, venue, and opening night.",
        "max_similarity_score": 0.4
    },
    {
        "name": "michelin_star",
        "goal": "Which restaurant was most recently awarded a Michelin star? Include the restaurant's name, city, and the total number of stars it has.",
        "max_similarity_score": 0.31578947368421056
    },
    {
        "name": "volcano_activity",
        "goal": "Has there been any significant volcanic activity in the past week? If yes, provide the volcano name and details of the eruption.",
        "max_similarity_score": 0.4897959183673469
    },
    {
        "name": "business_award",
        "goal": "Who recently won the Entrepreneur of the Year award? Include the entrepreneur's name, company, and key achievements.",
        "max_similarity_score": 0.5
    },
    {
        "name": "concert_announcement",
        "goal": "Has a popular artist recently announced a new concert tour? If yes, provide the artist's name, the tour's name, and tour dates.",
        "max_similarity_score": 0.32558139534883723
    },
    {
        "name": "art_exhibition",
        "goal": "Identify an upcoming art exhibition featuring modern or contemporary art. Include the exhibition's name, venue, and opening date.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "travel_trend",
        "goal": "What is a recent notable travel trend? Include a brief description of the trend and its impact on the travel industry.",
        "max_similarity_score": 0.35
    },
    {
        "name": "startup_success",
        "goal": "Name a startup that has recently gained significant attention or success. Include the startup's name, industry, and why it's noteworthy.",
        "max_similarity_score": 0.3783783783783784
    },
    {
        "name": "dance_competition",
        "goal": "What is the biggest upcoming international dance competition? Include the competition's name, location, and dates.",
        "max_similarity_score": 0.4375
    },
    {
        "name": "endangered_language",
        "goal": "Can you identify a recently classified endangered language? Provide the language's name, native region, and number of speakers.",
        "max_similarity_score": 0.45
    },
    {
        "name": "poetry_announcement",
        "goal": "Is there an upcoming major poetry competition or event? If yes, provide the competition's name, venue, and date.",
        "max_similarity_score": 0.5
    },
    {
        "name": "medical_research",
        "goal": "What is a recent breakthrough in medical research? Include the field of study and a brief description of the discovery.",
        "max_similarity_score": 0.4878048780487805
    },
    {
        "name": "food_innovation",
        "goal": "Has there been a recent innovation in the food industry? Provide details on the innovation and its impact.",
        "max_similarity_score": 0.4390243902439025
    },
    {
        "name": "weather_news",
        "goal": "What is the latest extreme weather event being reported? Provide details on the event and its impact.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "best_company_to_work",
        "goal": "What is the latest company to be named as the best place to work? Include the company's name and industry.",
        "max_similarity_score": 0.4324324324324324
    },
    {
        "name": "book_award",
        "goal": "What is the most recent winner of the Booker Prize for Fiction? Include the winning book's title and author.",
        "max_similarity_score": 0.45833333333333337
    },
    {
        "name": "water_scarcity",
        "goal": "Is there a recent water scarcity issue being reported? If yes, provide details on the affected region and the severity of the situation.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "software_update",
        "goal": "What is the latest significant software update or release? Include the software name, version, and a brief description of the update.",
        "max_similarity_score": 0.4878048780487805
    },
    {
        "name": "music_festival_finder",
        "goal": "Locate three upcoming music festivals in the United States featuring popular bands or artists. Provide festival names, dates, locations, and headline performers.",
        "max_similarity_score": 0.28
    },
    {
        "name": "celebrity_cookbook",
        "goal": "Find a recently published cookbook by a celebrity chef. Include the title, author, release date, and a brief overview of the recipes.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "tech_launches",
        "goal": "List three newly launched smartphones on the market. Provide key features, prices, and release dates for each.",
        "max_similarity_score": 0.23076923076923078
    },
    {
        "name": "marathon_planner",
        "goal": "Identify an upcoming marathon held in New York City. Include the race name, distance, registration details, and date.",
        "max_similarity_score": 0.43243243243243246
    },
    {
        "name": "art_exhibition_locator",
        "goal": "Discover an art exhibition nearby that features contemporary artists. Provide the exhibition's name, location, and a brief description of the showcased art.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "fashion_trends",
        "goal": "Determine the top three women's fashion trends for spring, and provide a brief summary of each trend.",
        "max_similarity_score": 0.3773584905660377
    },
    {
        "name": "scientific_breakthrough",
        "goal": "Find one groundbreaking scientific discovery or technological innovation published in a reputable journal within the past month. Describe its implications and potential impact on society.",
        "max_similarity_score": 0.25
    },
    {
        "name": "social_issues_debater",
        "goal": "Outline one current social issue receiving media attention. Explain the controversy and provide evidence supporting both sides of the discussion.",
        "max_similarity_score": 0.24242424242424246
    },
    {
        "name": "travel_destinations",
        "goal": "Recommend three travel destinations gaining popularity in 2023. Offer a brief description of each location's attractions and unique qualities.",
        "max_similarity_score": 0.4
    },
    {
        "name": "crypto_currency",
        "goal": "What is the current market value of Bitcoin, Ethereum, and Litecoin? Provide sources for verification.",
        "max_similarity_score": 0.5
    },
    {
        "name": "startup_spotlight",
        "goal": "Highlight a promising startup that has recently received significant funding. Provide the company's name, industry, invested amount, and a brief company overview.",
        "max_similarity_score": 0.4888888888888889
    },
    {
        "name": "environmental_news",
        "goal": "Report on a recent environmental issue or solution that has gained attention. Give a summary of the issue and its potential consequences or benefits.",
        "max_similarity_score": 0.3111111111111111
    },
    {
        "name": "health_study_finder",
        "goal": "Find a recent health study that reveals new findings about diet and exercise. Explain the study's main discoveries and their implications.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "language_learning",
        "goal": "Which language learning app is currently ranked as the highest in the app store? Provide the app's name, developer, and a brief description of its features.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "car_releases",
        "goal": "Identify an electric car model that is expected to be released within the next three months. Include the car's make, model, specifications, and expected price.",
        "max_similarity_score": 0.38461538461538464
    },
    {
        "name": "food_delivery",
        "goal": "Recommend a top-rated food delivery service in Palo Alto, California. Provide the service's name, user ratings, and a brief description of its offerings.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "vaccine_update",
        "goal": "Present the latest news on a COVID-19 vaccine, its manufacturer, recent clinical trials, and current approval status.",
        "max_similarity_score": 0.4
    },
    {
        "name": "housing_market",
        "goal": "Provide a brief analysis of the current housing market status in Miami, Florida, including average home prices and trends.",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "reality_tv_show",
        "goal": "Identify a popular reality TV show that is currently airing. Give the show's name, network, and a brief description of its premise.",
        "max_similarity_score": 0.4545454545454545
    },
    {
        "name": "gourmet_burger_recipe",
        "goal": "Share a mouthwatering gourmet burger recipe that includes unique ingredients and preparation instructions.",
        "max_similarity_score": 0.2580645161290323
    },
    {
        "name": "wildlife_encounter",
        "goal": "Discover recent news about an encounter between a wild animal and humans. Offer a brief account of the event, its location, and the outcome.",
        "max_similarity_score": 0.3111111111111111
    },
    {
        "name": "coffee_shop_finder",
        "goal": "Locate a well-reviewed, locally-owned coffee shop in Seattle, Washington. Share the shop's name, address, and a brief description of its environment.",
        "max_similarity_score": 0.4489795918367347
    },
    {
        "name": "historical_museum",
        "goal": "Find a historical museum located in Washington, D.C. that showcases American history. Offer the museum's name, address, and a brief overview of its exhibits.",
        "max_similarity_score": 0.48000000000000004
    },
    {
        "name": "virtual_conference",
        "goal": "Uncover an upcoming virtual conference focusing on artificial intelligence. Provide the event name, date, registration details, and topics to be covered.",
        "max_similarity_score": 0.4
    },
    {
        "name": "workout_plan",
        "goal": "Outline a one-week workout plan that incorporates both strength training and cardio exercises.",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "mental_health_resource",
        "goal": "Identify an online resource that offers mental health support and resources for individuals struggling with anxiety. Share the platform's name, a brief description, and a link to the website.",
        "max_similarity_score": 0.33962264150943394
    },
    {
        "name": "space_news",
        "goal": "Provide details about a recent space exploration mission, including the mission's objectives, participating countries, and launch date.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "nutrition_facts",
        "goal": "Determine the caloric content, fat, and protein amounts present in a single serving of a popular fast food item. Mention the food item's name and restaurant chain.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "volunteer_opportunity",
        "goal": "Locate a volunteer opportunity near Los Angeles, California, that benefits underprivileged children. Include the organization's name, a brief description of the volunteer work, and contact information.",
        "max_similarity_score": 0.36
    },
    {
        "name": "gardening_tips",
        "goal": "Share three essential tips for starting a successful vegetable garden.",
        "max_similarity_score": 0.21428571428571427
    },
    {
        "name": "riddles_function",
        "goal": "Provide two riddles that are suitable for children aged 7-10 years old.",
        "max_similarity_score": 0.17391304347826086
    },
    {
        "name": "architecture_spotlight",
        "goal": "Identify one famous architect and his/her most notable building. Give a brief history of the architect and the building's significance.",
        "max_similarity_score": 0.3255813953488372
    },
    {
        "name": "astronomy_news",
        "goal": "Report on a recent astronomical event or discovery. Offer a summary of the event and its implications for our understanding of the universe.",
        "max_similarity_score": 0.4680851063829787
    },
    {
        "name": "theme_park_recommendation",
        "goal": "Recommend an amusement park near Orlando, Florida, that is suitable for families with young children. Provide the park's name, location, and a brief description of its attractions.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "patent_finder",
        "goal": "Locate a recently granted patent for an innovative product or invention. Share the patent's name, inventor, publication date, and a brief outline of the invention.",
        "max_similarity_score": 0.4
    },
    {
        "name": "culinary_classes",
        "goal": "Discover a culinary school or cooking class in Atlanta, Georgia. Mention the institution's name, program offerings, and a brief description of its courses.",
        "max_similarity_score": 0.4583333333333333
    },
    {
        "name": "yoga_studio",
        "goal": "Find a reputable yoga studio in Portland, Oregon. Offer the studio's name, location, class offerings, and a summary of its teaching approach.",
        "max_similarity_score": 0.44897959183673475
    },
    {
        "name": "poetry_contest",
        "goal": "Discover an ongoing poetry contest open to both amateur and professional poets. Provide the contest's name, entry requirements, submission deadline, and potential prizes.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "instant_camera_reviews",
        "goal": "Compare two popular instant cameras currently available on the market. Offer key features, prices, and user ratings for each camera model.",
        "max_similarity_score": 0.4736842105263158
    },
    {
        "name": "home_decoration",
        "goal": "Outline three creative ways to repurpose old furniture into stylish and functional home décor.",
        "max_similarity_score": 0.15384615384615383
    },
    {
        "name": "exercise_trends",
        "goal": "Identify three exercise trends that have gained popularity in 2023. Outline the key components and potential benefits of each fitness trend.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "online_security",
        "goal": "List three tips to improve online security and protect personal information.",
        "max_similarity_score": 0.23076923076923075
    },
    {
        "name": "3d_printing_innovations",
        "goal": "Describe a recent innovation in 3D printing technology that has potential to impact various industries. Outline the innovation's features, potential applications, and possible challenges.",
        "max_similarity_score": 0.32558139534883723
    },
    {
        "name": "mars_landing",
        "goal": "What are the latest research progressions on the most recent Mars landing mission? Please include the mission's name and discoveries made so far.",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "iot_security",
        "goal": "Identify the top 5 Internet of Things (IoT) security concerns for 2023 and propose solutions to address them.",
        "max_similarity_score": 0.20689655172413793
    },
    {
        "name": "nobel_laureate",
        "goal": "Who won the Nobel Prize in Physics in 2022? Briefly describe their work.",
        "max_similarity_score": 0.24000000000000002
    },
    {
        "name": "sustainable_fashion",
        "goal": "List down three sustainable fashion brands that are creating an environmental impact in 2023.",
        "max_similarity_score": 0.16
    },
    {
        "name": "wild_animal_conservation",
        "goal": "What are the recent efforts taken by organizations for wildlife conservation in Africa? Please provide the name of the organizations and their initiatives.",
        "max_similarity_score": 0.3404255319148936
    },
    {
        "name": "cryptocurrency_update",
        "goal": "What is the current price of Bitcoin and Ethereum? Also, mention any significant news regarding these cryptocurrencies.",
        "max_similarity_score": 0.37037037037037035
    },
    {
        "name": "clean_energy",
        "goal": "Name three clean energy companies that have made significant breakthroughs in 2023. Provide the company names and brief descriptions of their breakthroughs.",
        "max_similarity_score": 0.23076923076923075
    },
    {
        "name": "artificial_food_production",
        "goal": "What are some developments being made in creating artificial food substitutes? Please provide at least 3 recent examples.",
        "max_similarity_score": 0.24390243902439024
    },
    {
        "name": "life_expectancy_stats",
        "goal": "What is the life expectancy rate in Japan? How does it compare to that of the United States?",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "successful_startup",
        "goal": "What were the top 3 successful technology startups in 2022, and what were their accomplishments?",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "reusable_space_rocket",
        "goal": "What is the latest advancement in designing reusable space rockets in 2023? Please provide the company's name and a brief overview of its development.",
        "max_similarity_score": 0.4
    },
    {
        "name": "security_threats",
        "goal": "What are the major cybersecurity threats in 2023? List down at least 3 such threats.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "electric_cars",
        "goal": "What are the latest electric car models in the market in 2023? Please list 5 models with their manufacturers.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "food_delivery_drones",
        "goal": "Mention the progress of food delivery using drones in different parts of the world. Please provide at least two examples.",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "climate_change_adaptation",
        "goal": "Briefly explain the current global climate change adaptation strategy and its effectiveness.",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "bridge_discovery",
        "goal": "Which country has completed the construction of the largest pedestrian suspension bridge in the world in 2023? Provide the bridge's name and location.",
        "max_similarity_score": 0.3673469387755102
    },
    {
        "name": "graffiti_tour",
        "goal": "Where can I find the best graffiti art tour in New York?",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "rural_internet_advancement",
        "goal": "What are the most innovative efforts taken to provide affordable internet access in rural areas? Provide at least two examples.",
        "max_similarity_score": 0.36842105263157887
    },
    {
        "name": "medical_breakthrough",
        "goal": "What is a significant medical breakthrough in 2022? Explain the treatment and its impact.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "plastic_alternative",
        "goal": "List three recently discovered alternative materials to replace plastics in packaging.",
        "max_similarity_score": 0.23999999999999996
    },
    {
        "name": "smart_city_progress",
        "goal": "What are the top 3 smart cities in the world as of 2023? Briefly explain the progress and key features of each city.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "cellular_agriculture",
        "goal": "How has cellular agriculture evolved in recent years, and what are its potential applications?",
        "max_similarity_score": 0.21428571428571427
    },
    {
        "name": "green_investment",
        "goal": "What are the top 3 green investment opportunities in the market for 2023? Please provide a brief explanation for each opportunity.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "robotic_surgery_evolution",
        "goal": "What are the latest developments in the field of robotic-assisted surgery, and how do they improve patient outcomes?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "sea_level_rise",
        "goal": "Which coastal cities are at the highest risk of being submerged due to sea-level rise, and what are the mitigation measures being implemented?",
        "max_similarity_score": 0.186046511627907
    },
    {
        "name": "quantum_computing",
        "goal": "Which companies have made significant progress in quantum computing in 2023? Briefly discuss their achievements.",
        "max_similarity_score": 0.3783783783783784
    },
    {
        "name": "ocean_cleanup_project",
        "goal": "Describe the progress and current status of the Ocean Cleanup Project to reduce ocean plastic pollution.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "major_sports_event",
        "goal": "Which major international sports events are going to occur in 2023? Please list at least three events and their dates.",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "satellite_internet",
        "goal": "What significant advancements have been made in satellite internet technology in 2023, and how could it impact global connectivity?",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "music_awards_winner",
        "goal": "Who were the winners of the Grammy Awards 2023 for the Best New Artist and Album of the Year categories? Please provide the artist names and the album titles.",
        "max_similarity_score": 0.26415094339622647
    },
    {
        "name": "fusion_energy",
        "goal": "What are the progress and recent advancements in nuclear fusion energy technology in 2023?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "traffic_congestion_solution",
        "goal": "What innovative solutions have been proposed for managing traffic congestion in major cities? Please provide at least two examples.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "supercomputing_race",
        "goal": "Which countries are currently competing in the race of developing the world's most powerful supercomputers? List at least three countries and their progress.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "gender_equality_employment",
        "goal": "Which countries have the highest gender equality in the workforce? Provide the top three countries.",
        "max_similarity_score": 0.35897435897435903
    },
    {
        "name": "remote_work_progress",
        "goal": "Where does remote work stand in 2023, and what are the major trends driving its growth?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "gene_editing_applications",
        "goal": "What are the latest gene-editing breakthroughs in medicine and agriculture in 2023? Please provide at least two examples for each domain.",
        "max_similarity_score": 0.4285714285714286
    },
    {
        "name": "textile_waste_reduction",
        "goal": "What are the latest innovations in reducing textile waste during the manufacturing process? List down at least three examples.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "coral_reef_protection",
        "goal": "What are the current measures being implemented for the protection and restoration of coral reefs across the globe?",
        "max_similarity_score": 0.34146341463414637
    },
    {
        "name": "space_hotel",
        "goal": "Are there any commercial space hotels currently operating or in development, and when can we expect them to be functional?",
        "max_similarity_score": 0.1818181818181818
    },
    {
        "name": "renewable_energy_sources",
        "goal": "What percentage of the world's energy was produced from renewable sources in 2023, and which country had the highest percentage of renewable energy production?",
        "max_similarity_score": 0.25641025641025644
    },
    {
        "name": "refugees_crisis",
        "goal": "What are the major refugee crises currently happening in different parts of the world, and what are the main causes?",
        "max_similarity_score": 0.35
    },
    {
        "name": "movie_platform",
        "goal": "What are the top 3 streaming platforms for watching movies and TV shows in 2023?",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "electric_plane",
        "goal": "What is the progress made in developing electric commercial airplanes? Please provide the names of the companies working on it.",
        "max_similarity_score": 0.37209302325581395
    },
    {
        "name": "language_translation_tool",
        "goal": "What are the top 3 most accurate language translation tools in the market in 2023?",
        "max_similarity_score": 0.5
    },
    {
        "name": "non_vocal_communication",
        "goal": "What advancements have been made in developing communication technologies for individuals who cannot speak or vocalize? Mention at least two examples.",
        "max_similarity_score": 0.4
    },
    {
        "name": "recipe_finder",
        "goal": "Find a recipe for gluten-free chocolate chip cookies with almond flour, including the ingredients and steps to make them.",
        "max_similarity_score": 0.25806451612903225
    },
    {
        "name": "travel_advisor",
        "goal": "What are the top 3 tourist attractions in Tokyo, Japan for first-time visitors?",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "jazz_legends",
        "goal": "Who are three living and influential jazz musicians today?",
        "max_similarity_score": 0.20689655172413793
    },
    {
        "name": "software_developer_jobs",
        "goal": "Identify 5 open remote software developer job positions in San Francisco, CA. Provide job titles, company names, and URLs to the job listings.",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "celebrity_news",
        "goal": "Identify the latest news or gossip about film actor Tom Cruise.",
        "max_similarity_score": 0.18181818181818182
    },
    {
        "name": "concert_planner",
        "goal": "Find information on the next Coldplay concert in New York City, including the date, venue, and ticket prices.",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "meow_adoption",
        "goal": "Give me info about a nearby cat adoption event or center, including the location and available cats.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "college_tuition_report",
        "goal": "Find the annual tuition cost for undergraduate students at Stanford University for the academic year 2023-2024.",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "grammar_check",
        "goal": "Provide a corrected version of the following sentence: \"Him went to store for buy milk.\"",
        "max_similarity_score": 0.24
    },
    {
        "name": "healthy_dinner",
        "goal": "Find a healthy dinner recipe with chicken and vegetables as the main ingredients.",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "technology_news",
        "goal": "Identify the latest breakthrough or announcement in the field of artificial intelligence.",
        "max_similarity_score": 0.3870967741935484
    },
    {
        "name": "marathon_schedule",
        "goal": "Find the date and start time of the 2023 New York City Marathon.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "menu_diet_plan",
        "goal": "Create a vegan meal plan for three days consisting of breakfast, lunch, and dinner.",
        "max_similarity_score": 0.1764705882352941
    },
    {
        "name": "weather_forecast",
        "goal": "What is the weather forecast for New York City for the next seven days?",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "book_recommendation",
        "goal": "Suggest three popular science fiction books published in the past year.",
        "max_similarity_score": 0.1951219512195122
    },
    {
        "name": "cryptocurrency_performance",
        "goal": "How has Bitcoin performed in the market over the past week?",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "recipe_finder",
        "goal": "Find a highly-rated, low-calorie dessert recipe that is vegan and gluten-free.",
        "max_similarity_score": 0.29629629629629634
    },
    {
        "name": "job_opportunities",
        "goal": "List three job openings for software engineers in the San Francisco Bay Area with the highest salary posted in the last week.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "stock_investment",
        "goal": "Which three stocks have had the highest percentage increase in value in the last month?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "travel_destination",
        "goal": "Recommend a top family vacation destination in Europe that isn't crowded during the summer months.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "online_course_finder",
        "goal": "What are three highly-rated online courses on data science available for enrollment?",
        "max_similarity_score": 0.27272727272727276
    },
    {
        "name": "tech_news",
        "goal": "What is the latest news about Elon Musk's SpaceX?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "renewable_energy_statistics",
        "goal": "What percentage of electricity generation comes from renewable sources in Germany?",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "marathon_event",
        "goal": "When and where will the next Boston Marathon take place?",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "theater_performance",
        "goal": "What is the highest-rated Broadway show currently playing in New York City?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "bird_species_identification",
        "goal": "Identify a bird species known for its vibrant blue color and distinctive song, native to North America.",
        "max_similarity_score": 0.22857142857142856
    },
    {
        "name": "political_news",
        "goal": "What is the latest update concerning the Prime Minister of the United Kingdom's stance on climate change?",
        "max_similarity_score": 0.36842105263157887
    },
    {
        "name": "gadget_comparison",
        "goal": "Compare the features and prices of the top two smartphones released in the past month.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "museum_exhibits",
        "goal": "What are the current special exhibits at the Louvre Museum in Paris, France?",
        "max_similarity_score": 0.4347826086956522
    },
    {
        "name": "stock_market_news",
        "goal": "What significant event has recently impacted the US stock market?",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "endangered_species",
        "goal": "What is a critically endangered animal species in Southeast Asia?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "skincare_product",
        "goal": "Find a highly-rated, affordable, and cruelty-free moisturizer for sensitive skin.",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "language_learning_resource",
        "goal": "Recommend three highly-rated apps or websites for learning Spanish.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "fitness_trends",
        "goal": "What is a popular workout trend that has emerged in 2023?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "startup_investment",
        "goal": "What is the latest startup to raise over $10 million in a funding round?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "gardening_advice",
        "goal": "What steps should be taken to prepare a backyard garden for spring planting?",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "movie_suggestions",
        "goal": "What are the latest three romantic comedy movies to be included on Netflix?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "historical_fact",
        "goal": "What major event in world history happened on April 30th?",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "sports_update",
        "goal": "Who won the most recent NBA championship game?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "celebrity_engagement",
        "goal": "Which celebrity couple recently announced their engagement?",
        "max_similarity_score": 0.18181818181818182
    },
    {
        "name": "wildlife_photography_contest",
        "goal": "Who was the winner of the 2023 Wildlife Photographer of the Year competition?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "car_purchase",
        "goal": "What is the best-selling electric car model in the United States in 2023?",
        "max_similarity_score": 0.48484848484848486
    },
    {
        "name": "education_news",
        "goal": "What recent change to the educational system in the United States is currently making headlines?",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "weight_loss_tips",
        "goal": "What are the latest scientifically-proven methods for losing weight without exercise?",
        "max_similarity_score": 0.32
    },
    {
        "name": "space_exploration_mission",
        "goal": "What is the newest space exploration mission announced by NASA?",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "acclaimed_artist",
        "goal": "Which living artist recently received a prestigious international award for their work?",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "charity_organization",
        "goal": "What is a reputable charity organization focusing on children's education?",
        "max_similarity_score": 0.28571428571428564
    },
    {
        "name": "scientific_discoveries",
        "goal": "What recent breakthrough in the field of medicine has the potential to change lives?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "weather_event",
        "goal": "What significant weather event is currently impacting the East Coast of the United States?",
        "max_similarity_score": 0.43750000000000006
    },
    {
        "name": "humanitarian_crisis",
        "goal": "What ongoing humanitarian crisis is currently receiving international attention?",
        "max_similarity_score": 0.27272727272727276
    },
    {
        "name": "architectural_innovation",
        "goal": "What is a newly-completed building that it's considered a masterpiece of modern architecture?",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "archeological_discovery",
        "goal": "What significant archaeological discovery was recently made in Egypt?",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "water_conservation",
        "goal": "What is a new technology or invention that aids in water conservation?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "sustainable_product",
        "goal": "Identify an innovative and eco-friendly product that has recently gained attention.",
        "max_similarity_score": 0.1818181818181818
    },
    {
        "name": "medical_breakthrough",
        "goal": "What recent medical breakthrough might revolutionize cancer treatment?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "airline_announcement",
        "goal": "What new route has been recently announced by a major airline?",
        "max_similarity_score": 0.28571428571428564
    },
    {
        "name": "company_merger",
        "goal": "What is the latest high-profile company merger or acquisition?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "recipe_finder",
        "goal": "Find a healthy recipe for a vegan dinner that takes less than 45 minutes to prepare and includes ingredients easily found in grocery stores. Provide instructions.",
        "max_similarity_score": 0.30769230769230776
    },
    {
        "name": "currency_converter",
        "goal": "How many British pounds (GBP) can I get for 5000 United States dollars (USD) today? Show the conversion rate.",
        "max_similarity_score": 0.20689655172413793
    },
    {
        "name": "vacation_planning",
        "goal": "Plan a 5-day itinerary with top attractions in Kyoto, Japan for a first-time visitor.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "book_recommendation",
        "goal": "Suggest a critically acclaimed mystery novel published in the last year, written by an author from Canada.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "programming_tutorial",
        "goal": "Find a beginner-friendly tutorial on Python programming that received positive reviews from users. Share the link.",
        "max_similarity_score": 0.24390243902439027
    },
    {
        "name": "fashion_trends",
        "goal": "What are the three most popular fashion trends for men this season?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "language_learning_tool",
        "goal": "Recommend an effective language learning app for learning Japanese that's highly rated by users.",
        "max_similarity_score": 0.24
    },
    {
        "name": "productivity_app",
        "goal": "Find a top-rated productivity app compatible with both PC and smartphone devices.",
        "max_similarity_score": 0.32
    },
    {
        "name": "sports_news_update",
        "goal": "Provide an update on the most recent soccer match in the English Premier League, including the date, match results and highlights.",
        "max_similarity_score": 0.358974358974359
    },
    {
        "name": "technology_launches",
        "goal": "List the latest two significant technology product launches announced within the past week. Give a brief description of each product.",
        "max_similarity_score": 0.28
    },
    {
        "name": "summer_trip",
        "goal": "Find a trip destination for a family of four that is less than 10 hours of travel from Chicago for a week in July and has lodging availability.",
        "max_similarity_score": 0.29629629629629634
    },
    {
        "name": "coding_challenge",
        "goal": "Locate a programming challenge website for intermediate and advanced programmers. Provide website link and activity descriptions.",
        "max_similarity_score": 0.2
    },
    {
        "name": "electric_car_comparison",
        "goal": "Compare the Tesla Model 3 and the Chevy Bolt EV in terms of range, charging time, and cost.",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "fitness_challenge",
        "goal": "Create a 30-day workout plan for a high-intensity interval training (HIIT) at home with limited equipment.",
        "max_similarity_score": 0.25
    },
    {
        "name": "space_launch_schedule",
        "goal": "When is the next SpaceX Falcon 9 rocket launch? Provide launch details and mission objectives.",
        "max_similarity_score": 0.24
    },
    {
        "name": "international_news_update",
        "goal": "Report the latest news about the conflict in the Middle East.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "top_restaurants",
        "goal": "List three top-rated Italian restaurants with pizza options in New York City, based on customer reviews.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "quantum_computing_development",
        "goal": "Find recent breakthroughs in quantum computing within the last month.",
        "max_similarity_score": 0.32
    },
    {
        "name": "local_activity",
        "goal": "What is a fun outdoors activity to do near Seattle this weekend suitable for a group of four friends?",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "job_application_guide",
        "goal": "Share a step-by-step guide on how to create a standout software engineering resume that will help applicants land interviews.",
        "max_similarity_score": 0.2
    },
    {
        "name": "covid_vaccine_update",
        "goal": "Outline updated guidelines for COVID-19 vaccine booster shots, as recommended by the Centers for Disease Control and Prevention (CDC).",
        "max_similarity_score": 0.2
    },
    {
        "name": "camera_purchase",
        "goal": "Recommend an affordable mirrorless camera for beginners that has interchangeable lenses and is good for photography and videography.",
        "max_similarity_score": 0.2424242424242424
    },
    {
        "name": "art_exhibition",
        "goal": "List upcoming local art exhibitions in Los Angeles open to the public during May 2023.",
        "max_similarity_score": 0.20689655172413796
    },
    {
        "name": "space_exploration_news",
        "goal": "What is the most recent update on the Mars Perseverance Rover mission?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "drone_buying_guide",
        "goal": "Provide a 2023 guide to selecting the best drone for a budget of up to $1000, considering factors such as flight time, camera quality, and ease of use.",
        "max_similarity_score": 0.2127659574468085
    },
    {
        "name": "best_smartphones",
        "goal": "List the top 3 smartphones available in the market as of April 2023 according to expert reviews.",
        "max_similarity_score": 0.43749999999999994
    },
    {
        "name": "fitness_tracker_comparison",
        "goal": "Compare the Apple Watch Series 7 and the Fitbit Sense in terms of battery life, features, and cost.",
        "max_similarity_score": 0.5
    },
    {
        "name": "university_rankings",
        "goal": "What are the top three universities in the field of computer science in the United States as of 2023?",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "local_political_news",
        "goal": "Provide an update on the mayoral election in San Francisco.",
        "max_similarity_score": 0.3870967741935483
    },
    {
        "name": "healthy_dessert_recipe",
        "goal": "Find a diabetes-friendly dessert recipe containing less than 10 grams of sugar per serving.",
        "max_similarity_score": 0.27906976744186046
    },
    {
        "name": "urban_planning_challenge",
        "goal": "Describe an innovative urban planning project recently implemented in a major city to tackle traffic congestion.",
        "max_similarity_score": 0.2222222222222222
    },
    {
        "name": "national_park_visit",
        "goal": "Plan a one-day itinerary to visit the Grand Canyon National Park, including transportation and must-see sights.",
        "max_similarity_score": 0.2916666666666667
    },
    {
        "name": "best_laptop_purchase",
        "goal": "Recommend a portable laptop for under $1,000 that is suitable for business and personal use.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "market_price_comparator",
        "goal": "What is the average price of a one-bedroom apartment for rent in Los Angeles and New York City?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "real_estate_property",
        "goal": "Find a newly-constructed four-bedroom house for sale in Houston, Texas, within a budget of $500,000.",
        "max_similarity_score": 0.25
    },
    {
        "name": "environmental_news",
        "goal": "Provide recent news and updates on global climate change policies.",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "best_watches",
        "goal": "List the top three luxury watch brands and describe a popular model from each brand.",
        "max_similarity_score": 0.24000000000000002
    },
    {
        "name": "renewable_energy_update",
        "goal": "What is the progress of the United States' goal toward utilizing 100% renewable energy?",
        "max_similarity_score": 0.5
    },
    {
        "name": "public_transport_planner",
        "goal": "Find the fastest public transportation route from Union Station in Los Angeles to Santa Monica Pier, with departure and arrival times.",
        "max_similarity_score": 0.25
    },
    {
        "name": "nutrition_facts",
        "goal": "Find the nutritional content, including calories, carbohydrates, and protein, of a Starbucks Grande Caffe Latte with almond milk.",
        "max_similarity_score": 0.27586206896551724
    },
    {
        "name": "successful_investor",
        "goal": "Who is the most successful investor in the tech industry to date, and what are their major investment achievements?",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "endangered_species",
        "goal": "Identify a recently-discovered endangered species and the conservation efforts being made to protect it.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "top_college_debates",
        "goal": "Which two educational institutions competed in the final round of the US Universities Debating Championship 2023? What was the result of the competition?",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "oscar_winner",
        "goal": "Who won the Academy Award for Best Actor in the 2023 Oscars?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "scientific_advancements",
        "goal": "Share an important scientific discovery made in the field of medicine within the past month.",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "tech_industry_news",
        "goal": "Provide recent news on the merger or acquisition of a major technology company.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "mental_health_app",
        "goal": "Find a highly-rated mental health app aimed at anxiety management.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "financial_health_tips",
        "goal": "List three expert-recommended tips for millennials seeking to improve their financial health in 2023.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "work_from_home_jobs",
        "goal": "Find a full-time remote job in the field of content writing and editing with a competitive salary.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "exercise_routine_creator",
        "goal": "Develop a 30-minute exercise routine for someone wanting to improve their cardiovascular health and muscle strength. Include a sequence of exercises, recommended repetitions, and rest times.",
        "max_similarity_score": 0.23809523809523808
    },
    {
        "name": "running_event",
        "goal": "Which marathon event is scheduled to take place in New York City in October 2023? Provide the date, starting point, and registration requirements.",
        "max_similarity_score": 0.34146341463414637
    },
    {
        "name": "arts_festival",
        "goal": "Identify an upcoming music festival in California for summer 2023. Provide the festival name, location, dates, and three headline acts.",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "nutrition_list",
        "goal": "What are the top five healthy lunch recipes to prepare under 30 minutes? List the ingredients and brief preparation instructions.",
        "max_similarity_score": 0.2926829268292683
    },
    {
        "name": "tech_conference",
        "goal": "Can you suggest a major technology conference happening in San Francisco in the first half of 2023? Give the event name, location, dates, and two keynote speakers.",
        "max_similarity_score": 0.29787234042553196
    },
    {
        "name": "disaster_relocation",
        "goal": "Locate a recent natural disaster in the world and identify the immediate steps taken by the local government to relocate and support affected people.",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "job_opportunities",
        "goal": "What are the top five companies hiring remotely for software developers in the United States as of May 2023? List the job titles and requirements.",
        "max_similarity_score": 0.5
    },
    {
        "name": "scholarship_finder",
        "goal": "List three fully-funded scholarships for international students to pursue a Master's degree in the United States starting in the 2023-2024 academic year.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "green_energy",
        "goal": "What recent advancements have been made in renewable energy technology, such as solar or wind power generation? List at least two developments.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "blood_drive",
        "goal": "Can you find an upcoming blood donation camp organized in Boston during May 2023? Provide the date, time, and location.",
        "max_similarity_score": 0.35
    },
    {
        "name": "medical_breakthrough",
        "goal": "Identify a recent medical breakthrough regarding the treatment of cancer. Provide a summary of the discovery and its implications.",
        "max_similarity_score": 0.4242424242424242
    },
    {
        "name": "election_results",
        "goal": "Who were the winners of the most recent United States Senate elections? List the names and the states they represent.",
        "max_similarity_score": 0.40816326530612246
    },
    {
        "name": "book_fair",
        "goal": "Locate a major book fair event taking place in London during 2023. Provide the fair's name, location, dates, and any notable guest authors.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "music_awards",
        "goal": "Who won the Album of the Year and Artist of the Year awards at the most recent Grammy Awards? List the winners and the names of their albums (if applicable).",
        "max_similarity_score": 0.4
    },
    {
        "name": "space_exploration",
        "goal": "What was the latest manned space exploration mission by any country? Provide mission name, launch date, destination, and main objectives.",
        "max_similarity_score": 0.4
    },
    {
        "name": "startup_competition",
        "goal": "Find a global startup competition that is accepting applications for 2023. Provide competition name, deadline, requirements, and prize value.",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "foreign_exchange",
        "goal": "What is the current exchange rate for converting US dollars to British pounds and Japanese yen? Provide the exchange rates as of today's date.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "fashion_week",
        "goal": "When is the next Paris Fashion Week scheduled? Provide event dates and two prominent designer brands that will showcase their collections.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "endangered_species",
        "goal": "Identify a critically endangered species recently added to the IUCN Red List and the primary reasons for its endangerment.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "environmental_policy",
        "goal": "What major environmental policy has been recently announced or implemented by the European Union? Summarize the policy and its primary objectives.",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "charity_run",
        "goal": "Find a charitable cause running event taking place in Los Angeles in June 2023. Provide the event name, date, location, and the charity it supports.",
        "max_similarity_score": 0.4489795918367347
    },
    {
        "name": "gaming_tournament",
        "goal": "Are there any upcoming eSports tournaments in the United States worth attending? Give event name, dates, location, and the games being played.",
        "max_similarity_score": 0.29787234042553196
    },
    {
        "name": "architecture_award",
        "goal": "Which building project has recently won the Pritzker Architecture Prize? Provide the winning project's name, location, and architect(s).",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "new_car_release",
        "goal": "What is a highly anticipated electric vehicle set to be released in 2023? Give the vehicle's name, manufacturer, expected range, and price.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "theater_performance",
        "goal": "Discover a highly-rated Broadway show playing in New York City during the summer of 2023. Provide the show's name, theater, and leading actors.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "science_exhibition",
        "goal": "Locate a science exhibition for kids happening in Chicago during July 2023. Provide the exhibition name, location, entry fees, and age group requirements.",
        "max_similarity_score": 0.425531914893617
    },
    {
        "name": "extreme_weather",
        "goal": "Has there been any recent extreme weather event? Describe the location, type, and severity of the event, along with any reported damages or casualties.",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "culinary_event",
        "goal": "Discover an upcoming food festival taking place in Miami during the summer of 2023. Provide event name, dates, location, and participating restaurants.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "museum_reopening",
        "goal": "Has any famous museum recently reopened after extensive renovation? Share the museum's name, location, and newly added exhibitions or features.",
        "max_similarity_score": 0.3414634146341463
    },
    {
        "name": "travel_regulations",
        "goal": "What are the current COVID-19 travel restrictions and entry requirements for international travelers visiting Canada? List the requirements effective as of May 2023.",
        "max_similarity_score": 0.3673469387755102
    },
    {
        "name": "film_festival",
        "goal": "Which films won the top awards at the recent Cannes Film Festival? List the award-winning films and their categories.",
        "max_similarity_score": 0.4
    },
    {
        "name": "economy_report",
        "goal": "How did the US economy perform in the first quarter of 2023? Provide information on GDP growth rate, unemployment rate, and inflation rate.",
        "max_similarity_score": 0.2666666666666666
    },
    {
        "name": "vaccine_updates",
        "goal": "What is the status of ongoing clinical trials for a new COVID-19 vaccine? Provide the vaccine's name, developer, and current trial phase.",
        "max_similarity_score": 0.33333333333333326
    },
    {
        "name": "chess_tournament",
        "goal": "Which international chess tournament is set to take place in May 2023? Give the tournament name, location, dates, and prominent participants.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "innovative_technology",
        "goal": "Identify a recent technological invention or innovation that has the potential to improve human lives. Provide the technology's name and its primary applications.",
        "max_similarity_score": 0.372093023255814
    },
    {
        "name": "art_exhibition",
        "goal": "Locate an upcoming modern art exhibition in Berlin in 2023. Provide the exhibition name, dates, location, and featured artists.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "polar_expedition",
        "goal": "Find a recent or ongoing polar expedition focusing on climate change research. Provide the expedition's name, objectives, and participating countries.",
        "max_similarity_score": 0.35555555555555557
    },
    {
        "name": "biodiversity_crisis",
        "goal": "What is a recent event that has heightened concerns about biodiversity loss? Describe the event and its impact on the affected ecosystem.",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "finance_news",
        "goal": "Did any company or organization recently make a significant financial announcement? Share the name of the company, the announcement, and its implications.",
        "max_similarity_score": 0.3414634146341463
    },
    {
        "name": "language_festival",
        "goal": "Can you find an upcoming multilingual or multicultural festival happening in Washington, D.C., in 2023? Provide the event name, dates, and expected participants.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "wildlife_conservation",
        "goal": "Identify a recent successful wildlife conservation effort involving the rescue or rehabilitation of an endangered species. Provide details on the species and project.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "green_city_award",
        "goal": "Which city has been recently named the European Green Capital for 2023? Provide the city's name and some reasons behind its selection.",
        "max_similarity_score": 0.4186046511627907
    },
    {
        "name": "celebrity_engagement",
        "goal": "Has any famous celebrity couple announced their engagement recently? Share the couple's names and the circumstances surrounding the announcement.",
        "max_similarity_score": 0.3902439024390244
    },
    {
        "name": "airline_expansion",
        "goal": "Has any airline launched new flight routes for the summer of 2023? Provide the airline's name and the new routes added.",
        "max_similarity_score": 0.4255319148936171
    },
    {
        "name": "controversial_law",
        "goal": "What is a recently enacted controversial law or regulation that has generated significant debate? Provide the country, law, and opposing viewpoints.",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "education_initiative",
        "goal": "Identify a recent major education initiative, launched by a government or organization, that aims to improve learning outcomes for children. Provide the initiative's name and objectives.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "famous_landmark",
        "goal": "Has any historical landmark been recently added to the UNESCO World Heritage List? Provide the landmark's name, location, and significance.",
        "max_similarity_score": 0.4390243902439024
    },
    {
        "name": "water_management",
        "goal": "What new technological or infrastructural measures have been recently introduced to combat water scarcity in arid regions? List at least two examples.",
        "max_similarity_score": 0.3902439024390244
    },
    {
        "name": "archaeology_discovery",
        "goal": "Describe a recent major archaeological discovery that has shed light on ancient civilizations. Provide the discovery's location and significance.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "celebrity_engagement",
        "goal": "Discover which celebrity couple recently got engaged, and give a brief background on their relationship.",
        "max_similarity_score": 0.4545454545454545
    },
    {
        "name": "new_scientific_discovery",
        "goal": "What is a recent groundbreaking scientific discovery? Give an explanation of its significance.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "stock_market_nugget",
        "goal": "What crucial stock market news has impacted a major company's stock price today? Explain the news and its effects.",
        "max_similarity_score": 0.3529411764705882
    },
    {
        "name": "political_development_news",
        "goal": "What important political development happened in the United States Congress this week? Describe the event and its potential impact.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "soccer_match_result",
        "goal": "Find the latest scores and results from the English Premier League. Which team is currently leading the league standings?",
        "max_similarity_score": 0.3
    },
    {
        "name": "charity_info",
        "goal": "Which charitable organization is currently raising funds to provide clean drinking water to people in developing countries? Include their official website or donation page.",
        "max_similarity_score": 0.25
    },
    {
        "name": "popular_gadget",
        "goal": "What is the trending electronic gadget on the market right now? Provide a description, its features, and the price range.",
        "max_similarity_score": 0.36000000000000004
    },
    {
        "name": "new_music_release",
        "goal": "Which musician or band has just released a new album, and what is it called?",
        "max_similarity_score": 0.20689655172413796
    },
    {
        "name": "technology_breakthrough",
        "goal": "Discover a recent breakthrough in technology. Briefly explain its importance and potential applications.",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "world_record_breaker",
        "goal": "Have any Guinness World Records been broken recently? Explain the record and the achievement.",
        "max_similarity_score": 0.2941176470588235
    },
    {
        "name": "museum_exhibition",
        "goal": "Which premier art museum is hosting a special exhibition featuring a famous artist's work? Include exhibition dates and the museum's location.",
        "max_similarity_score": 0.23809523809523808
    },
    {
        "name": "trending_tech_tool",
        "goal": "Identify a trending technology tool that has gained significant traction in the past month. Include its name, purpose, and a brief description of its functionality.",
        "max_similarity_score": 0.32653061224489793
    },
    {
        "name": "stock_market_update",
        "goal": "Give me the latest stock market news, including any significant changes in major indices.",
        "max_similarity_score": 0.32
    },
    {
        "name": "crypto_price_tracker",
        "goal": "Find the current price of Bitcoin and Ethereum in US dollars.",
        "max_similarity_score": 0.5
    },
    {
        "name": "food_recipe_retriever",
        "goal": "Find a popular vegetarian recipe that includes potatoes and provide a link to the website.",
        "max_similarity_score": 0.35897435897435903
    },
    {
        "name": "job_opportunity_locator",
        "goal": "Identify a remote job opening for a UX designer. Include the company name, job role, and a link to the job posting.",
        "max_similarity_score": 0.3555555555555555
    },
    {
        "name": "breaking_news_highlighter",
        "goal": "Provide a summary of a major breaking news story that is happening right now.",
        "max_similarity_score": 0.29629629629629634
    },
    {
        "name": "book_best_seller_finder",
        "goal": "What is the best-selling non-fiction book this month? Include the title, author, and a brief synopsis.",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "travel_destination_suggester",
        "goal": "Suggest a popular tourist destination in the United States for a one-week summer vacation.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "car_release_announcer",
        "goal": "Which new car models have been released in the past month? List one car model and its specifications.",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "celebrity_birthday_wisher",
        "goal": "Whose birthday is it today among popular celebrities? Include the celebrity's name, age, and their accomplishment.",
        "max_similarity_score": 0.25531914893617025
    },
    {
        "name": "workout_routine_creator",
        "goal": "Design a 30-minute workout routine for beginners that consists of bodyweight exercises.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "popular_app_reviewer",
        "goal": "Which mobile app is currently popular? Provide its name, a description of its function, and user reviews.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "electric_vehicle_advancements",
        "goal": "Identify a recent innovation in electric vehicle technology. Describe the innovation and its implications for the industry.",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "sustainable_fashion_expert",
        "goal": "What is a major sustainable fashion trend in the textile industry? Provide a brief overview and an example company applying this trend.",
        "max_similarity_score": 0.33333333333333326
    },
    {
        "name": "job_market_reporter",
        "goal": "What are the top-demand jobs in the current job market? List three job titles and their descriptions.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "notable_artist_spotlight",
        "goal": "Who is an artist gaining notoriety in the last month? Describe their artwork and style.",
        "max_similarity_score": 0.32
    },
    {
        "name": "novel_synopsis",
        "goal": "Create a short synopsis for a science fiction novel set in a dystopian future, revolving around the theme of artificial intelligence rebellion.",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "job_market_update",
        "goal": "What are the five most in-demand job positions in the technology sector in 2023? Are there any new or emerging positions?",
        "max_similarity_score": 0.43243243243243246
    },
    {
        "name": "cryptocurrency_gains",
        "goal": "Which cryptocurrency experienced the highest percentage of gain in the past 30 days? Provide the cryptocurrency's name, symbol, and percentage increase.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "fitness_trend",
        "goal": "What is the hottest fitness trend right now? List three popular routines or exercises associated with this trend.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "electric_vehicle_market",
        "goal": "Which electric vehicle model has the highest sales in the past quarter, globally? State the model and the number of units sold.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "vacation_destination",
        "goal": "What are some of the top vacation destinations in 2023? Provide three travel spots with their main attractions.",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "sustainable_clothing",
        "goal": "Find an eco-friendly clothing brand that offers sustainable products. What is their mission statement, and what materials do they use?",
        "max_similarity_score": 0.24242424242424246
    },
    {
        "name": "housing_market_update",
        "goal": "What is the trend in the current housing market? Are there any notable changes compared to the previous year?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "major_conference",
        "goal": "What is the date, location, and theme of the next major technology conference in 2023?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "latest_medical_breakthrough",
        "goal": "What is a recent medical breakthrough made within the last month? What are its implications?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "latest_fashion_trend",
        "goal": "What is the current fashion trend dominating the season? Which designers or brands are leading this trend?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "endangered_species_discovery",
        "goal": "Has there been a newly discovered endangered species this year? If so, what is the name and a brief description of the species?",
        "max_similarity_score": 0.3773584905660377
    },
    {
        "name": "political_election",
        "goal": "What are the results of the most recent significant elections taking place? Please include winners' names, parties, and positions.",
        "max_similarity_score": 0.4186046511627907
    },
    {
        "name": "mars_exploration",
        "goal": "What is the latest news in Mars exploration? Are there any new discoveries?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "rare_art_auction",
        "goal": "What is the highest-priced piece of artwork sold in auction in the past month? Include the artwork's title, artist, and the winning bid amount.",
        "max_similarity_score": 0.37500000000000006
    },
    {
        "name": "top_startup",
        "goal": "Which startup company has raised the most funding in the past three months? Include the company's name, its industry, and the amount raised.",
        "max_similarity_score": 0.4
    },
    {
        "name": "upcoming_movie_release",
        "goal": "What is the name and release date of one highly anticipated movie coming out next month?",
        "max_similarity_score": 0.38709677419354843
    },
    {
        "name": "clean_energy_investment",
        "goal": "What is the latest clean energy project garnering significant investment? Who are the key investors, and how much has been invested?",
        "max_similarity_score": 0.3
    },
    {
        "name": "latest_nobel_prize_winner",
        "goal": "Who are the most recent Nobel Prize winners in physics, chemistry, and medicine, and what are their respective contributions?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "ancient_artifact_unearthed",
        "goal": "Has there been a significant archaeological discovery of ancient artifacts in the past three months? If so, where was it found, and what is its significance?",
        "max_similarity_score": 0.32653061224489793
    },
    {
        "name": "new_scientific_theory",
        "goal": "Is there a new scientific theory gaining traction in the scientific community? What is it about, and how does it affect the field?",
        "max_similarity_score": 0.2926829268292683
    },
    {
        "name": "world_record_summit",
        "goal": "Did someone recently break the world record for the fastest summit of Mount Everest? If so, who was it, and what was their time?",
        "max_similarity_score": 0.27999999999999997
    },
    {
        "name": "dance_competition_winner",
        "goal": "Who won the most recent international dance competition, and what was their routine's style?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "music_awards_show",
        "goal": "What are the results of the most recent major music awards show? Include the winners for Album of the Year, Song of the Year, and Best New Artist.",
        "max_similarity_score": 0.46808510638297873
    },
    {
        "name": "sneaker_release_hype",
        "goal": "What is the latest highly anticipated sneaker release? Include the sneaker's name, its brand, and the release date.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "international_tech_startup",
        "goal": "Which international startup company has recently received significant attention for its revolutionary technological product or service?",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "groundbreaking_film",
        "goal": "What is a groundbreaking film released in the past six months, and why has it garnered so much attention?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "new_national_park",
        "goal": "Has a new national park been designated within the past year? If so, where is it located, and what are its main features?",
        "max_similarity_score": 0.44897959183673475
    },
    {
        "name": "rock_climbing_challenge",
        "goal": "What is the site of the latest challenging rock-climbing route that has gained prominence in the climbing community?",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "latest_app_launch",
        "goal": "What is the name, creator, and purpose of a highly rated mobile app that has been recently launched?",
        "max_similarity_score": 0.411764705882353
    },
    {
        "name": "car_of_the_year",
        "goal": "What automobile model has been named Car of the Year by a reputable automotive publication in 2023? Provide the model and manufacturer.",
        "max_similarity_score": 0.3555555555555555
    },
    {
        "name": "space_telescope",
        "goal": "What is the latest discovery made utilizing a space telescope, and what are the findings' implications?",
        "max_similarity_score": 0.38709677419354843
    },
    {
        "name": "architectural_award",
        "goal": "Which building has recently received a prestigious architectural award? Include the building's name, its location, and the award it received.",
        "max_similarity_score": 0.4390243902439024
    },
    {
        "name": "successful_business_acquisition",
        "goal": "Which company has recently announced a successful acquisition of another company? Include both companies' names and the acquisition's value.",
        "max_similarity_score": 0.3414634146341463
    },
    {
        "name": "innovative_environmental_project",
        "goal": "What is an innovative environmental project recently launched to address climate change?",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "sports_comeback",
        "goal": "Is there a notable sports comeback story in the past three months? If so, who is the athlete and what sport do they participate in?",
        "max_similarity_score": 0.4313725490196078
    },
    {
        "name": "celebrity_charity_event",
        "goal": "What is the most recent charity event organized by a well-known celebrity? Which cause does it support?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "successful_experiment",
        "goal": "What is a recent high-profile and successful scientific experiment that has been conducted and published within the last month?",
        "max_similarity_score": 0.4571428571428572
    },
    {
        "name": "top_chef_award",
        "goal": "Who is the most recent winner of a prestigious culinary award? Include the chef's name, the restaurant they work at, and the award they received.",
        "max_similarity_score": 0.4680851063829788
    },
    {
        "name": "modern_art_prize",
        "goal": "Has there been an artwork awarded a significant modern art prize recently? If so, please provide the artwork's name, its artist, and the prize it won.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "marathon_winner",
        "goal": "Who won the most recent major marathon race? Include the winner's name, nationality, and their finishing time.",
        "max_similarity_score": 0.42424242424242425
    },
    {
        "name": "renowned_photographer",
        "goal": "Has a photographer recently gained substantial attention for their work? If so, who is the photographer, and what work garnered the attention?",
        "max_similarity_score": 0.3555555555555555
    },
    {
        "name": "museum_exhibition",
        "goal": "What is an upcoming or ongoing museum exhibition that has garnered significant interest and praise? Provide the exhibition's name, its location, and a brief description.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "drone_innovation",
        "goal": "What is a new and groundbreaking innovation in drone technology that has been recently announced or released?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "cybersecurity_threat",
        "goal": "Has there been a recent cybersecurity threat involving a high-profile company or organization? If yes, what happened, and what was the outcome?",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "online_learning_platform",
        "goal": "What is a new online learning platform that has been praised for its user engagement and high-quality content?",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "social_media_challenge",
        "goal": "Is there a new and popular social media challenge that has gone viral within the past month? If so, what is the challenge?",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "gas_price",
        "goal": "Find the cheapest gas station near Phoenix, Arizona, and provide the current price per gallon.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "recipe_finder",
        "goal": "Locate a vegan recipe that contains quinoa, sweet potatoes, and kale, then give a brief overview and cooking time.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "historical_anniversary",
        "goal": "What significant historical event occurred today, April 30th? Provide a brief explanation.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "trending_videos",
        "goal": "Identify three of the most popular YouTube videos in the past week. Include their titles and links.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "book_research",
        "goal": "I need a recommendation for a recent (published within the last 3 years) nonfiction book about artificial intelligence. Please include a brief summary.",
        "max_similarity_score": 0.27906976744186046
    },
    {
        "name": "political_news",
        "goal": "Provide a report on the latest development in the U.S. Congress today, regarding any new legislation or decisions.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "marathon_registration",
        "goal": "Give me information on how to register for the upcoming New York City Marathon, including the deadline and fees involved.",
        "max_similarity_score": 0.4736842105263158
    },
    {
        "name": "local_event",
        "goal": "What is a popular event happening in Austin, Texas this weekend? Include the date, time, and location.",
        "max_similarity_score": 0.3870967741935484
    },
    {
        "name": "job_fair",
        "goal": "Locate a job fair or career expo happening in Seattle within the next month, and provide the event's details.",
        "max_similarity_score": 0.31818181818181823
    },
    {
        "name": "restaurant_finder",
        "goal": "Recommend a highly-rated Italian restaurant in Chicago that offers outdoor seating and gluten-free options.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "celebrity_birthdays",
        "goal": "Which celebrities are celebrating their birthdays today, April 30th?",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "public_transport",
        "goal": "How can I get from Majorstuen to Oslo Central Station using public transportation? What is the estimated travel time?",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "road_closure",
        "goal": "Are there any major road closures or traffic delays in Los Angeles today?",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "college_application",
        "goal": "What are the application requirements, deadlines, and fees for applying to Stanford University for the upcoming academic year?",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "volunteer_opportunity",
        "goal": "Find a local volunteering opportunity in Miami for the month of May, preferably related to environmental conservation.",
        "max_similarity_score": 0.29629629629629634
    },
    {
        "name": "nature_activity",
        "goal": "Recommend a popular nature activity or trail within driving distance from Denver, Colorado.",
        "max_similarity_score": 0.21428571428571427
    },
    {
        "name": "oscar_winner",
        "goal": "Who won the Academy Award for Best Director in the most recent Oscar ceremony? Provide the name of the director and the title of the movie they directed.",
        "max_similarity_score": 0.45000000000000007
    },
    {
        "name": "charity_selection",
        "goal": "Identify three reputable environmental charities for potential donations. Provide their mission statements and the percentage of funds allocated directly to programs.",
        "max_similarity_score": 0.2222222222222222
    },
    {
        "name": "job_searcher",
        "goal": "Find five job vacancies related to web development in Denver, Colorado. Mention the job title, company, required experience, and salary range.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "fitness_app_review",
        "goal": "Outline the features and user ratings for three popular fitness apps available in the App Store.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "art_exhibition",
        "goal": "What are the three most well-known art exhibitions taking place in New York in May 2023? Provide the exhibition title, location, and opening hours.",
        "max_similarity_score": 0.40909090909090906
    },
    {
        "name": "gardening_advice",
        "goal": "Suggest five plants that can grow well in a small apartment with limited sunlight.",
        "max_similarity_score": 0.20689655172413796
    },
    {
        "name": "latest_smartphone",
        "goal": "What is the latest flagship smartphone from Apple? Describe its features, specifications, and pricing.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "travel_itinerary",
        "goal": "Outline a seven-day travel itinerary for a first-time visitor to Tokyo, Japan. Include popular tourist attractions, cultural events, and a local dining experience.",
        "max_similarity_score": 0.39024390243902435
    },
    {
        "name": "solar_energy_cost",
        "goal": "Calculate the approximate installation cost of a residential solar energy system in California, considering a 4-bedroom house.",
        "max_similarity_score": 0.21621621621621623
    },
    {
        "name": "marathon_record",
        "goal": "Who holds the current world record for the men's marathon? What was their finishing time and when did they achieve this record?",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "language_learning_tools",
        "goal": "List the top five language learning apps based on user reviews. Provide the app’s name and a brief description of its features.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "migraine_help",
        "goal": "Find three home remedies to alleviate migraine headaches that have scientific backing.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "nutrition_guide",
        "goal": "Generate a grocery list for a one-week healthy meal plan suitable for a family of four, focusing on plant-based meals.",
        "max_similarity_score": 0.2926829268292683
    },
    {
        "name": "sleep_tips",
        "goal": "Recommend four evidence-based strategies to improve sleep quality.",
        "max_similarity_score": 0.16666666666666669
    },
    {
        "name": "summer_camp",
        "goal": "Find three summer camp options in Los Angeles for children aged 10-12, emphasizing outdoor activities and creativity. Include camp descriptions and pricing.",
        "max_similarity_score": 0.22727272727272724
    },
    {
        "name": "stock_market",
        "goal": "What is the current stock price of Tesla Inc. (TSLA)?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "museum_exhibits",
        "goal": "What temporary exhibits are currently displayed at the Museum of Modern Art in New York City?",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "broadway_show_information",
        "goal": "What Broadway shows are opening this week? Include dates and venues.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "movie_recommendations",
        "goal": "What are the top 3 highest-grossing movies released this month?",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "newest_gadget",
        "goal": "What is the latest technology gadget released by Apple?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "job_openings",
        "goal": "Find a full-time software engineering job opening in San Francisco for someone with at least 5 years of experience.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "celebrity_donation",
        "goal": "Which celebrity made the largest donation to a charity within the past month?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "space_mission",
        "goal": "What is the next NASA mission scheduled to launch? Include the mission name and launch date.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "animal_rescue",
        "goal": "Find a reputable animal rescue organization in Los Angeles that is currently in need of volunteers.",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "scientific_breakthrough",
        "goal": "What is the most significant scientific breakthrough announced in the last 30 days?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "medical_advancement",
        "goal": "What new treatment or medication for Alzheimer's disease has been approved by the FDA recently?",
        "max_similarity_score": 0.3703703703703703
    },
    {
        "name": "major_league_roster",
        "goal": "Who are the starting players for the Los Angeles Lakers in the current NBA season?",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "upcoming_protest",
        "goal": "Are there any planned protests in the Capitol Hill area of Washington D.C. within the next week?",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "bestseller_books",
        "goal": "List the top 3 bestselling fiction books for this week.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "national_park_visit",
        "goal": "Suggest the best time of the year to visit Yosemite National Park in California.",
        "max_similarity_score": 0.29629629629629634
    },
    {
        "name": "notable_award",
        "goal": "Who is the most recent recipient of the Nobel Prize in Literature?",
        "max_similarity_score": 0.4516129032258065
    },
    {
        "name": "new_legislation",
        "goal": "What is the most recently passed federal bill in the United States and its purpose?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "popular_app",
        "goal": "What is the number 1 free app in the Apple App Store right now?",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "cultural_event",
        "goal": "What upcoming cultural event should I attend in New Orleans, Louisiana?",
        "max_similarity_score": 0.28571428571428564
    },
    {
        "name": "international_relations",
        "goal": "What is the latest significant event concerning the relationship between the United States and China?",
        "max_similarity_score": 0.4848484848484848
    },
    {
        "name": "university_information",
        "goal": "Find the acceptance rate and tuition fees for Harvard University.",
        "max_similarity_score": 0.37037037037037035
    },
    {
        "name": "online_learning",
        "goal": "Suggest a well-reviewed online course platform to learn programming languages like Python.",
        "max_similarity_score": 0.18749999999999997
    },
    {
        "name": "environmental_initiative",
        "goal": "What global environmental initiative started in the past month?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "art_auction",
        "goal": "What is the most expensive painting sold at auction in the past year?",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "tech_security",
        "goal": "What recent cybersecurity incident affected a major company?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "affordable_flight",
        "goal": "Find a round-trip flight from New York City to Paris, departing on June 15, 2023, and returning on June 22, 2023, under $1000.",
        "max_similarity_score": 0.24489795918367346
    },
    {
        "name": "seasonal_festival",
        "goal": "What festive event or holiday is celebrated in Japan in April?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "health_service",
        "goal": "Locate a highly-rated urgent care clinic in San Diego, California, open 24 hours.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "food_recall",
        "goal": "Name any food products that got recalled within the last 30 days.",
        "max_similarity_score": 0.32
    },
    {
        "name": "marathon_information",
        "goal": "Give me details about the upcoming Boston Marathon, including the registration deadline, race day, and course map.",
        "max_similarity_score": 0.48648648648648646
    },
    {
        "name": "endangered_species",
        "goal": "List a critically endangered species that was in the news in the past month.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "royal_news",
        "goal": "Share a recent headline involving the British royal family.",
        "max_similarity_score": 0.25
    },
    {
        "name": "international_travel_warning",
        "goal": "Are there any active travel advisories or warnings for Americans traveling to Greece?",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "tv_show_premiere",
        "goal": "What new television show is premiering on HBO next month?",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "stock_merger",
        "goal": "What two major companies recently announced a merger or acquisition?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "podcast_suggestion",
        "goal": "Name a popular true crime podcast.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "marine_conservation",
        "goal": "What significant marine conservation event or news took place in the past month?",
        "max_similarity_score": 0.4545454545454546
    },
    {
        "name": "innovative_products",
        "goal": "What is a recent innovative product developed in the renewable energy industry?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "space_exploration",
        "goal": "What is the most notable private company involved in space exploration and an achievement of theirs?",
        "max_similarity_score": 0.38709677419354843
    },
    {
        "name": "natural_disaster",
        "goal": "Was there any destructive natural disaster (hurricane, earthquake, wildfire) occurring in the past week?",
        "max_similarity_score": 0.32
    },
    {
        "name": "book_summary",
        "goal": "Give me a summary and review of a recently published science fiction novel that received a rating of at least 4 out of 5 stars.",
        "max_similarity_score": 0.29787234042553196
    },
    {
        "name": "music_album_reviews",
        "goal": "Find reviews for the latest album by a popular pop artist. Summarize overall opinions and share the average rating.",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "job_opportunities",
        "goal": "Identify three open positions for software engineers in San Francisco, CA with a minimum annual salary of $120,000. Provide company names, job titles, and application links.",
        "max_similarity_score": 0.44000000000000006
    },
    {
        "name": "investment_articles",
        "goal": "Find articles on the current impact of technological advancements on stock market trends. Summarize the main points.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "travel_destination",
        "goal": "Suggest a popular European travel destination for tourists in May and provide information on top attractions, local cuisine, and the average temperature during that month.",
        "max_similarity_score": 0.3
    },
    {
        "name": "weather_alert",
        "goal": "What is the current weather situation in Miami, Florida, and are there any weather alerts or advisories in effect?",
        "max_similarity_score": 0.48275862068965514
    },
    {
        "name": "language_course",
        "goal": "Recommend an online language course for learning Japanese at an intermediate level. Provide the course name, cost, and duration.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "nutrition_information",
        "goal": "Tell me the nutritional benefits of quinoa and provide a simple recipe that incorporates it.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "plant_identification",
        "goal": "Find information on a cactus species native to the southwestern United States. Describe its appearance, growth patterns, and care requirements.",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "scientific_discovery",
        "goal": "Share a recent scientific discovery in the field of biology. Give a brief explanation of its implications and potential impact on society.",
        "max_similarity_score": 0.4571428571428572
    },
    {
        "name": "zoo_information",
        "goal": "Find the details of a zoo in San Diego, CA. Provide the operating hours, admission fees for adults and children, and any must-see exhibits or animals.",
        "max_similarity_score": 0.24489795918367346
    },
    {
        "name": "product_launch",
        "goal": "Detail the recent launch of a smartphone by a major technology company. Share its key features, price, and release date.",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "art_exhibition",
        "goal": "Locate an art exhibition in London, UK featuring contemporary artists. Include exhibition dates, venue, and a brief description of the artwork on display.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "beach_vacation",
        "goal": "Recommend a beach destination in Asia with clean sands and clear waters. Provide information on popular activities, accommodations, and nearby attractions.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "vehicle_comparison",
        "goal": "Compare two recently released electric cars in terms of price, range, charging time, and safety ratings.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "celebrity_news",
        "goal": "Find the latest news about a famous Hollywood actor or actress, including information about current projects and public appearances.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "sports_scores",
        "goal": "What was the result of the most recent soccer match between Real Madrid and Barcelona?",
        "max_similarity_score": 0.42424242424242425
    },
    {
        "name": "recipe_finder",
        "goal": "Discover a delicious dessert recipe that contains no more than 200 calories per serving. Provide the ingredients list and instructions for preparation.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "podcast_suggestion",
        "goal": "Recommend a podcast discussing personal finance topics, specifically focusing on saving and investing. Share the podcast name, host, and a brief description.",
        "max_similarity_score": 0.31111111111111117
    },
    {
        "name": "technology_news",
        "goal": "Provide a synopsis of recent news articles discussing advancements in artificial intelligence.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "hiking_trails",
        "goal": "Track down information on three scenic hiking trails in the Rocky Mountains of Colorado. Include location, difficulty, and approximate hiking time for each trail.",
        "max_similarity_score": 0.24390243902439027
    },
    {
        "name": "find_tutor",
        "goal": "Recommend a qualified tutor for high school mathematics, available for online tutoring sessions. Share the tutor's name, qualifications, hourly rate, and contact information.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "workout_routine",
        "goal": "Find an effective 30-minute workout routine suitable for beginners. Describe the exercise sequence, required equipment, and expected results.",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "national_park_visit",
        "goal": "Offer information about visiting Yosemite National Park in California, including the best times to visit, lodging options, and must-see attractions.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "online_course",
        "goal": "Identify a reputable online course focused on enhancing negotiation skills for professionals. Supply the course name, website, course duration, and cost.",
        "max_similarity_score": 0.35
    },
    {
        "name": "upcoming_concert",
        "goal": "Share information about an upcoming music concert in Chicago, IL. Include the artist's name, venue, date, and ticket price.",
        "max_similarity_score": 0.36842105263157887
    },
    {
        "name": "breaking_news",
        "goal": "Find the most recent breaking news that occurred in the last 24 hours. Provide a brief summary and relevant links.",
        "max_similarity_score": 0.3529411764705882
    },
    {
        "name": "museum_visit",
        "goal": "What are the operating hours and admission fees for the Smithsonian Air and Space Museum in Washington, DC?",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "marathon_information",
        "goal": "What is the date and location of the next Boston Marathon, and what are the eligibility requirements for participants?",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "solar_energy",
        "goal": "Retrieve information about a recent breakthrough in solar energy efficiency. Provide a summary and potential implications.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "find_pharmacy",
        "goal": "Find the nearest 24-hour pharmacy in Las Vegas, NV. Include the address, phone number, and operating hours.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "charitable_organization",
        "goal": "Research a popular charitable organization that focuses on global hunger. Provide a brief overview, including how to donate.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "political_news",
        "goal": "Describe recent changes to a major piece of domestic legislation in the United Kingdom.",
        "max_similarity_score": 0.3448275862068965
    },
    {
        "name": "real_estate",
        "goal": "Find a recently listed 3-bedroom, 2-bathroom house in Los Angeles, CA with a budget of $1 million. Provide the listing details, photos, and contact information.",
        "max_similarity_score": 0.3555555555555555
    },
    {
        "name": "professional_conference",
        "goal": "Locate an upcoming professional conference for digital marketers in the United States. Include the conference name, dates, location, and registration information.",
        "max_similarity_score": 0.45
    },
    {
        "name": "seasonal_fruit",
        "goal": "What fruits are currently in season? Suggest a simple fruit-based dessert recipe that can be prepared easily.",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "volunteer_opportunity",
        "goal": "Identify a local volunteer opportunity in Seattle, WA that involves working with children. Provide the details on the organization, commitment requirements, and contact information.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "e-commerce_shop",
        "goal": "Discover a top-rated e-commerce website selling sustainable and eco-friendly household products. Describe the range of products available and share the website link.",
        "max_similarity_score": 0.24390243902439027
    },
    {
        "name": "financial_analysis",
        "goal": "Summarize recent analyses of the performance of a major tech company's stock and the opinions of experts on its future performance.",
        "max_similarity_score": 0.3428571428571428
    },
    {
        "name": "animal_shelter",
        "goal": "Locate an animal shelter in New York City where I can adopt a dog. Share the shelter's name, address, operating hours, and adoption requirements.",
        "max_similarity_score": 0.32653061224489793
    },
    {
        "name": "cybersecurity_threat",
        "goal": "What is a recently emerged cybersecurity threat and how can users protect themselves against it? Include expert advice and recommendations.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "environmental_news",
        "goal": "Share an article discussing a recent development in the fight against climate change. Provide a summary and the article source.",
        "max_similarity_score": 0.38888888888888884
    },
    {
        "name": "home_renovation",
        "goal": "Locate a popular blog post that offers tips and ideas for remodeling a small bathroom on a budget. Include the blog's name and a summary of their suggestions.",
        "max_similarity_score": 0.3137254901960784
    },
    {
        "name": "sports_award",
        "goal": "Which athlete recently won the NBA MVP award, and what were their outstanding achievements of the season?",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "best_camera",
        "goal": "Recommend a top-rated mirrorless camera for travel photography under $1,500. Include the camera model, key features, and approximate price.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "job_interview",
        "goal": "Propose a list of common software engineering job interview questions, focusing on coding and problem-solving skills.",
        "max_similarity_score": 0.25641025641025644
    },
    {
        "name": "space_exploration",
        "goal": "What is the current status of NASA's Artemis program? Provide updates on mission objectives, launch dates, and crew selection.",
        "max_similarity_score": 0.38888888888888884
    },
    {
        "name": "upcoming_concerts",
        "goal": "What concerts or music festivals are scheduled for July 2023? Provide at least three different events, their dates, and locations.",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "fitness_activity_finder",
        "goal": "What is a local outdoor fitness activity or sports club in New York City for adults interested in team sports?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "learn_coding",
        "goal": "Which programming language is currently considered the best to learn for web development? Find one highly-rated online course for learning this language.",
        "max_similarity_score": 0.24242424242424243
    },
    {
        "name": "space_exploration_news",
        "goal": "What is the most recent significant development or discovery in space exploration?",
        "max_similarity_score": 0.5
    },
    {
        "name": "new_restaurant",
        "goal": "Which newly-opened restaurant in London has received the best reviews for the month of April 2023?",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "cyber_security_advice",
        "goal": "What are the top three cybersecurity practices individuals should follow to better protect their personal data and devices?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "weather_update",
        "goal": "What is today's weather forecast for Sydney, Australia?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "museum_exhibition",
        "goal": "Which art, history, or science museum in Los Angeles is currently hosting a highly-anticipated temporary exhibition?",
        "max_similarity_score": 0.35
    },
    {
        "name": "podcast_suggestion",
        "goal": "Can you find the most popular podcast episodes related to mental health and wellness released in the past six months?",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "acquire_new_language",
        "goal": "What is the most efficient way to learn a new language? Find a highly-rated resource or platform for learning Japanese.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "national_park_visit",
        "goal": "Which U.S. national park is recommended for a family-friendly trip with activities like hiking, sightseeing, and wildlife viewing?",
        "max_similarity_score": 0.2162162162162162
    },
    {
        "name": "public_transportation",
        "goal": "What are the public transportation options available for commuting from Union Station in Washington, D.C., to the White House?",
        "max_similarity_score": 0.3902439024390244
    },
    {
        "name": "allergy_relief",
        "goal": "What is the best current way to alleviate hay fever symptoms for allergy sufferers during the spring season?",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "coffee_shop",
        "goal": "Where is a cozy coffee shop with free Wi-Fi and comfortable seating located near Central Park in New York City?",
        "max_similarity_score": 0.3
    },
    {
        "name": "job_search",
        "goal": "What are the top three trending career fields with high demand for jobs in 2023?",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "fitness_trainer_recommendation",
        "goal": "Can you find top-rated personal fitness trainers in San Diego, California who specialize in weight loss and strength training?",
        "max_similarity_score": 0.2941176470588235
    },
    {
        "name": "car_sales_statistics",
        "goal": "What brand and model of electric vehicle had the highest sales in the United States in 2022?",
        "max_similarity_score": 0.45161290322580644
    },
    {
        "name": "rare_animal_discovery",
        "goal": "Could you report on a recently discovered rare or unknown animal species?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "upcoming_technology",
        "goal": "What is an upcoming technological innovation that has the potential to significantly impact daily life?",
        "max_similarity_score": 0.35897435897435903
    },
    {
        "name": "movie_release",
        "goal": "What are the most anticipated movies to be released in May 2023?",
        "max_similarity_score": 0.48000000000000004
    },
    {
        "name": "solar_energy_projects",
        "goal": "Name one recent significant solar energy project in the United States.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "cooking_class",
        "goal": "Where to find a highly-rated vegan cooking class in Toronto?",
        "max_similarity_score": 0.4
    },
    {
        "name": "find_least_popular_streams",
        "goal": "What is considered the least popular kind of content that is consistently streamed on Twitch? Suggest one niche streamer.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "home_organization",
        "goal": "Identify popular home organization hacks and tips for small living spaces.",
        "max_similarity_score": 0.21428571428571427
    },
    {
        "name": "university_program",
        "goal": "Which university offers a top-ranked program for studying artificial intelligence in the United States?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "volunteer_opportunities",
        "goal": "What organizations are currently looking for volunteers to help with environmental conservation projects?",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "online_shopping",
        "goal": "Where can I find the best deal on a brand new pair of Nike running shoes?",
        "max_similarity_score": 0.5
    },
    {
        "name": "crowdfunding_projects",
        "goal": "What are the top three innovative crowdfunding projects on Kickstarter in April 2023?",
        "max_similarity_score": 0.5
    },
    {
        "name": "road_trip_planner",
        "goal": "Design a scenic road trip route from San Francisco to Los Angeles along the Pacific Coast Highway, including three must-see stops.",
        "max_similarity_score": 0.3
    },
    {
        "name": "local_farmers_market",
        "goal": "Where can I find a well-reviewed farmers market in Chicago open on weekends?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "renewable_energy",
        "goal": "Which country is currently leading in renewable energy production and investments?",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "upcoming_elections",
        "goal": "When are the upcoming 2023 general elections in the United Kingdom?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "college_scholarships",
        "goal": "Where can high school seniors find scholarships for college or university in the United States?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "app_developer_jobs",
        "goal": "In which city and country is there currently a high demand for app developers in the tech industry?",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "health_app",
        "goal": "Which health and fitness app is currently trending and highly-rated in the Google Play Store and Apple App Store?",
        "max_similarity_score": 0.3529411764705882
    },
    {
        "name": "real_estate_trends",
        "goal": "What are the current residential real estate market trends in Los Angeles?",
        "max_similarity_score": 0.4
    },
    {
        "name": "bicycle_route",
        "goal": "What is a scenic bicycle route in Amsterdam for a leisurely half-day ride?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "find_hiking_trail",
        "goal": "Identify a moderately challenging hiking trail in or near Denver, Colorado, that offers great views.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "electric_scooter_sharing",
        "goal": "Which electric scooter sharing service is available in San Francisco, and what are their pricing plans?",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "national_geographic_winner",
        "goal": "Who won the 2022 National Geographic Travel Photographer of the Year contest, and what was the winning photograph?",
        "max_similarity_score": 0.3870967741935484
    },
    {
        "name": "tech_conferences",
        "goal": "List three major technology conferences scheduled in the first half of 2023.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "writing_contest",
        "goal": "Which reputable short story writing contests have deadlines approaching within the next four months?",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "climate_report",
        "goal": "Present the most recent information about the effects of climate change on Arctic ice coverage.",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "crypto_investment",
        "goal": "Suggest three popular cryptocurrencies to invest in and provide their current market values.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "allergy_advice",
        "goal": "What pollen levels should allergy sufferers in Los Angeles be mindful of in the coming week?",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "recipe_finder",
        "goal": "Find a quick and easy recipe for vegan chocolate cake and provide the list of ingredients.",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "sports_update",
        "goal": "Report the latest results of major league soccer matches.",
        "max_similarity_score": 0.3
    },
    {
        "name": "budget_travel",
        "goal": "Find budget-friendly travel packages to Europe scheduled for the upcoming summer season.",
        "max_similarity_score": 0.2580645161290323
    },
    {
        "name": "best_drone",
        "goal": "Recommend a high-quality drone with camera capabilities that is suitable for beginners.",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "language_course",
        "goal": "Find a reputable online platform for learning French and provide information about the available courses.",
        "max_similarity_score": 0.38709677419354843
    },
    {
        "name": "movie_reviews",
        "goal": "Report the critical reception of the latest superhero movie.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "virtual_reality",
        "goal": "Identify a recently released virtual reality headset and summarize its features.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "art_exhibition",
        "goal": "Find an ongoing art exhibition at a major art museum.",
        "max_similarity_score": 0.24242424242424243
    },
    {
        "name": "tech_news",
        "goal": "What is the latest breakthrough in quantum computing?",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "scientific_discovery",
        "goal": "Report a recent major discovery in the field of astronomy.",
        "max_similarity_score": 0.4375
    },
    {
        "name": "book_recommendation",
        "goal": "Recommend a recently published science fiction book that received positive reviews.",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "job_portal",
        "goal": "Find a web developer job opening in San Francisco with high salary and employee benefits.",
        "max_similarity_score": 0.4864864864864865
    },
    {
        "name": "natural_disaster",
        "goal": "Report the latest information on a natural disaster that occurred recently.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "space_exploration",
        "goal": "Which countries are collaborating on a new space exploration mission to Mars?",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "political_debate",
        "goal": "When is the next presidential debate scheduled, and who are the participating candidates?",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "startup_funding",
        "goal": "Which startup recently received a significant funding round, and who are the investors?",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "mobile_application",
        "goal": "Identify a new mobile app that has gained popularity for mental health support and describe its features.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "product_launch",
        "goal": "Which tech company is launching a new innovative gadget soon, and what does it do?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "gardening_guide",
        "goal": "Find a gardening guide for growing a specific plant and provide care instructions.",
        "max_similarity_score": 0.3589743589743589
    },
    {
        "name": "celebrity_news",
        "goal": "What is the latest news related to a popular celebrity?",
        "max_similarity_score": 0.5
    },
    {
        "name": "tv_series_review",
        "goal": "Find reviews for the latest season of a popular TV series.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "music_concert",
        "goal": "Get the details of an upcoming music concert featuring a popular band.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "solar_power",
        "goal": "Which company recently developed a large-scale solar power project, and where is it located?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "animal_rescue",
        "goal": "Locate an animal shelter near me with an adoption event this weekend.",
        "max_similarity_score": 0.2702702702702703
    },
    {
        "name": "charity_events",
        "goal": "Find local charity events happening next month that support children in need.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "electric_vehicle",
        "goal": "Identify a recently launched electric vehicle model and provide information about its battery range and charging options.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "college_admissions",
        "goal": "Find the application deadline for Fall 2023 admissions at a prestigious university.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "business_incubator",
        "goal": "Identify a renowned business incubator program for startups and provide details on its application process.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "patents",
        "goal": "What new patent was recently granted in the field of robotics?",
        "max_similarity_score": 0.4
    },
    {
        "name": "renewable_energy",
        "goal": "Report the latest development in the renewable energy sector regarding wind power.",
        "max_similarity_score": 0.4516129032258065
    },
    {
        "name": "crowdfunding_campaign",
        "goal": "Identify a successful crowdfunding campaign for an innovative product and provide details about the product and campaign.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "e_learning",
        "goal": "What are the emerging trends in e-learning for the education sector?",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "health_conference",
        "goal": "Find the dates and location of an upcoming international health conference.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "youth_program",
        "goal": "Identify a local youth program that focuses on cultural exchange and provide information about the application process.",
        "max_similarity_score": 0.43749999999999994
    },
    {
        "name": "programming_competition",
        "goal": "When and where is the next international programming competition for college students happening?",
        "max_similarity_score": 0.4347826086956522
    },
    {
        "name": "wildlife_conservation",
        "goal": "What are some recent efforts made towards wildlife conservation in Africa?",
        "max_similarity_score": 0.4705882352941176
    },
    {
        "name": "travel_alert",
        "goal": "Find current travel advisories for international travelers.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "retail_discounts",
        "goal": "What are the best deals available on electronics during the upcoming sale event?",
        "max_similarity_score": 0.4545454545454546
    },
    {
        "name": "book_finder",
        "goal": "What's a highly praised science fiction book released in the past six months? Include the author and a short description.",
        "max_similarity_score": 0.45
    },
    {
        "name": "workout_planner",
        "goal": "Give me a beginner-friendly 15-minute yoga routine with step-by-step instructions.",
        "max_similarity_score": 0.22857142857142854
    },
    {
        "name": "upcoming_events",
        "goal": "Find an interesting upcoming event in Los Angeles within the following week. Provide details, time, and location.",
        "max_similarity_score": 0.4324324324324324
    },
    {
        "name": "election_tracker",
        "goal": "What are the latest polling results for an ongoing political election? Include candidates, percentages, and date of the poll.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "tv_series_suggester",
        "goal": "Suggest a recently premiered TV series with a high IMDb rating. Provide a brief overview and where to watch it.",
        "max_similarity_score": 0.3157894736842105
    },
    {
        "name": "meet_your_hero",
        "goal": "Identify a nearby meet-and-greet happening soon with a famous celebrity. Include date, time, and venue.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "fashion_trends",
        "goal": "Name a current fashion trend and provide examples of clothing items or accessories that can help achieve the look.",
        "max_similarity_score": 0.23529411764705882
    },
    {
        "name": "sports_update",
        "goal": "Give an update on today's NBA games with a focus on scores, standout players, and team standings.",
        "max_similarity_score": 0.21621621621621623
    },
    {
        "name": "new_restaurant_spotter",
        "goal": "Discover a newly opened restaurant in downtown Chicago known for its delicious food. Provide the cuisine type, address, and contact information.",
        "max_similarity_score": 0.35555555555555557
    },
    {
        "name": "phone_comparison",
        "goal": "Compare the iPhone 13 and Samsung Galaxy S21: what are the main differences in features, battery life, and camera quality?",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "concert_locator",
        "goal": "Find an upcoming concert or live music event in Austin, Texas, for an indie rock or electronic music performance.",
        "max_similarity_score": 0.27777777777777773
    },
    {
        "name": "best_friends",
        "goal": "Which dog breeds are known for being low-shedding and hypoallergenic? Suggest a few cute dog breeds for allergy sufferers.",
        "max_similarity_score": 0.2105263157894737
    },
    {
        "name": "travel_planner",
        "goal": "What is the least expensive direct flight from Seattle to Miami on May 15, 2023? List the airline and departure time.",
        "max_similarity_score": 0.4242424242424242
    },
    {
        "name": "allergy_alert",
        "goal": "What is today's pollen count in Atlanta, Georgia? Are allergy sufferers advised to limit their time outdoors?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "buy_a_bike",
        "goal": "Find a highly rated bike shop in Denver that sells electric bicycles. Include the name, address, and phone number.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "museum_visit",
        "goal": "Discover a special exhibition currently running at the Metropolitan Museum of Art. Provide the exhibit title, description, and duration.",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "tech_release",
        "goal": "What is a highly anticipated tech product release that is slated to happen within the next 30 days?",
        "max_similarity_score": 0.34146341463414637
    },
    {
        "name": "cryptocurrency_analysis",
        "goal": "How does Bitcoin's price performance compare to Ethereum's over the past 24 hours?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "concert_finder",
        "goal": "Which popular musician has an upcoming concert in Chicago within the next month?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "book_best_seller",
        "goal": "List the current top three best-selling books in the Fiction category.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "job_title_trends",
        "goal": "Which new job title in the tech industry has become increasingly popular over the past year?",
        "max_similarity_score": 0.3703703703703703
    },
    {
        "name": "national_park_visitor",
        "goal": "Which National Park has experienced a significant increase in visitor numbers in the past year?",
        "max_similarity_score": 0.3448275862068965
    },
    {
        "name": "medical_breakthrough",
        "goal": "What is a recent breakthrough in medical research related to the treatment of Alzheimer's disease?",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "college_rankings",
        "goal": "Which university has moved up the most in the latest world university rankings?",
        "max_similarity_score": 0.4
    },
    {
        "name": "space_exploration",
        "goal": "What is the next mission to Mars, and which space agency is behind it?",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "stock_market_news",
        "goal": "What company had the biggest increase in stock price in the last week?",
        "max_similarity_score": 0.5
    },
    {
        "name": "airline_merger",
        "goal": "Is there any recent news about major airline mergers or acquisitions?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "olympic_update",
        "goal": "What was the most recent world record broken in the prior Olympic Games?",
        "max_similarity_score": 0.4
    },
    {
        "name": "celebrity_birthday",
        "goal": "Which celebrity is celebrating their birthday today, and how old are they turning?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "fuel_prices",
        "goal": "Provide the average cost per gallon of regular-grade gasoline in Los Angeles for today.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "endangered_species",
        "goal": "What species has been added to the endangered list within the past month?",
        "max_similarity_score": 0.41176470588235287
    },
    {
        "name": "political_debate",
        "goal": "What was the topic of the most recent televised political debate among candidates for public office?",
        "max_similarity_score": 0.45161290322580644
    },
    {
        "name": "educational_grant",
        "goal": "What government grant for higher education was recently announced, and who is eligible to apply?",
        "max_similarity_score": 0.25
    },
    {
        "name": "corporate_social_responsibility",
        "goal": "Which company recently announced significant steps towards reducing their carbon emissions?",
        "max_similarity_score": 0.4444444444444444
    },
    {
        "name": "stand_up_comedy",
        "goal": "Find the name of a stand-up comedian who has a new comedy special airing soon.",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "pandemic_response",
        "goal": "Which country recently announced progress in their Covid-19 vaccination campaign?",
        "max_similarity_score": 0.4444444444444444
    },
    {
        "name": "sustainable_innovation",
        "goal": "What environmentally sustainable product has been successful in reducing plastic waste?",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "global_efforts",
        "goal": "Provide details on a recently-effective international collaboration tackling climate change.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "public_transport_expansion",
        "goal": "What city is expanding their public transportation network with new routes and vehicles?",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "AI_in_healthcare",
        "goal": "Which company released an AI-powered healthcare product that helps diagnose diseases more effectively?",
        "max_similarity_score": 0.23076923076923075
    },
    {
        "name": "electric_vehicle",
        "goal": "Which electric vehicle model recently received rave reviews and became a market success?",
        "max_similarity_score": 0.32
    },
    {
        "name": "nature_preservation",
        "goal": "What land has been recently designated as a protected area or nature reserve?",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "eSports_tournament",
        "goal": "What is the prize pool for the upcoming major eSports tournament?",
        "max_similarity_score": 0.4
    },
    {
        "name": "mobile_app_trend",
        "goal": "Which mobile app has seen a surge in popularity within the last month?",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "scientific_award",
        "goal": "Who was recently awarded a prestigious scientific honor and for what discovery or contribution?",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "new_gadget",
        "goal": "What new gadget is revolutionizing the market for home automation devices?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "clean_energy_project",
        "goal": "Which clean energy project has recently been completed and is now in operation?",
        "max_similarity_score": 0.30303030303030304
    },
    {
        "name": "architectural_masterpiece",
        "goal": "What awe-inspiring building has recently been completed and is receiving international attention for its design?",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "transportation_innovation",
        "goal": "What latest innovation in transportation has the potential to drastically reduce travel times?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "underwater_discovery",
        "goal": "What has been the most significant recent underwater discovery or exploration achievement?",
        "max_similarity_score": 0.5
    },
    {
        "name": "retail_success",
        "goal": "Which retail store has seen substantial growth in sales in the last quarter?",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "sports_contract",
        "goal": "What athlete has recently signed a multi-million dollar contract with a new team?",
        "max_similarity_score": 0.32
    },
    {
        "name": "notable_biography",
        "goal": "Which influential person has recently published a biography or memoir?",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "emerging_artist",
        "goal": "Which up-and-coming musician just had their first Billboard-charting hit?",
        "max_similarity_score": 0.22222222222222224
    },
    {
        "name": "space_tourism",
        "goal": "What company is making headlines with their plans for commercial space tourism?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "fitness_trend",
        "goal": "What is the most popular fitness trend or workout routine at the moment?",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "social_initiative",
        "goal": "Which social initiative has recently been successful in making a positive impact on people's lives?",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "renewable_energy",
        "goal": "What major renewable energy project has recently commenced construction?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "job_searcher",
        "goal": "What are the top three job openings for a data scientist role in San Francisco, CA? Provide the job title, company name, and job description for each position.",
        "max_similarity_score": 0.39215686274509803
    },
    {
        "name": "charity_finder",
        "goal": "Identify the top three animal welfare organizations in the United States. Provide the organization name and a brief description of their goals and activities.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "election_reviewer",
        "goal": "What are the results of the 2022 US midterm elections? List the percentage of total seats won by each major party in the House of Representatives and the Senate.",
        "max_similarity_score": 0.3859649122807017
    },
    {
        "name": "tech_news_recap",
        "goal": "What are the latest headlines in the technology industry today? Provide the headline and a one-sentence summary for the top three news articles.",
        "max_similarity_score": 0.35897435897435903
    },
    {
        "name": "book_suggestion",
        "goal": "What are the top three best-selling nonfiction books of 2022? Provide the title, author, and a brief summary of each book's content.",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "cultural_event",
        "goal": "What noteworthy cultural or arts events are happening in New York City during May 2023? List the top three events with their dates and a brief description.",
        "max_similarity_score": 0.3829787234042553
    },
    {
        "name": "startup_business",
        "goal": "What are the top three trending startup businesses as of April 2023? Provide the company name, founder(s), and a brief overview of their business model.",
        "max_similarity_score": 0.48000000000000004
    },
    {
        "name": "language_discovery",
        "goal": "Which endangered language has recently received significant attention for revitalization efforts this month? Give a brief overview of the language and the efforts being made.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "restaurant_review",
        "goal": "What are the top three must-try restaurants in Los Angeles in April 2023? Provide the restaurant name, cuisine type, and a highlight from their menu.",
        "max_similarity_score": 0.5
    },
    {
        "name": "market_insights",
        "goal": "What is the current status of the US stock market, specifically for technology companies? Provide a general overview focusing on recent trends and headlines.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "environmental_initiative",
        "goal": "What is a noteworthy environmental initiative or project that launched recently? Describe the initiative and its objectives in a few sentences.",
        "max_similarity_score": 0.37209302325581395
    },
    {
        "name": "travel_advisor",
        "goal": "What new travel destinations have been trending in 2023? Provide a list of the top three destinations with a brief description of each.",
        "max_similarity_score": 0.44000000000000006
    },
    {
        "name": "recipe_finder",
        "goal": "What is a delicious and simple dessert recipe that has gained popularity in 2023? Provide the recipe name, ingredients list, and instructions.",
        "max_similarity_score": 0.5
    },
    {
        "name": "covid_update",
        "goal": "What is the current status of COVID-19 vaccinations worldwide? Provide updated statistics on the total number of doses administered and the percentage of the global population vaccinated.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "social_cause",
        "goal": "What social cause or movement has gained significant momentum in the past month? Describe the cause and its objectives briefly.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "marketing_strategy",
        "goal": "What is a new and innovative marketing strategy that companies have started using in 2023? Describe the strategy and its potential benefits.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "lottery_winnings",
        "goal": "Who is the latest jackpot winner of the national lottery? Provide the winner's name, the total amount won, and the date of the drawing.",
        "max_similarity_score": 0.4313725490196078
    },
    {
        "name": "organic_recommendation",
        "goal": "Where can I find the nearest organic store near downtown Chicago? Provide the store name and address.",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "fame_rise",
        "goal": "Who is a rising actor or actress in Hollywood making a significant impact in 2023? Provide their name and a brief overview of their career.",
        "max_similarity_score": 0.44
    },
    {
        "name": "fitness_equipment",
        "goal": "What is a popular home fitness equipment that gained popularity this year? Provide the product name, manufacturer, and main features.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "alternative_energy",
        "goal": "What new alternative energy source has been making headlines in April 2023? Describe the energy source and its potential applications.",
        "max_similarity_score": 0.4285714285714286
    },
    {
        "name": "investment_opportunity",
        "goal": "What investment opportunity is generating buzz this month? Provide the opportunity's name, main features, and potential returns.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "videogame_release",
        "goal": "What is the most anticipated videogame release scheduled for May 2023? Provide the game title, developer, and a brief overview of the game's storyline.",
        "max_similarity_score": 0.44
    },
    {
        "name": "fitness_challenge",
        "goal": "What new fitness challenge has gained popularity on social media in 2023? Describe the challenge and its purpose in a few sentences.",
        "max_similarity_score": 0.4285714285714286
    },
    {
        "name": "app_innovation",
        "goal": "What is a newly launched mobile app in 2023 that is gaining popularity? Provide the app's name, developer, and a brief description of its main features.",
        "max_similarity_score": 0.5
    },
    {
        "name": "automobile_advancement",
        "goal": "What is a new advancement in automobile technology that has been recently unveiled? Provide a brief overview of the advancement and its potential impact.",
        "max_similarity_score": 0.48780487804878053
    },
    {
        "name": "skincare_innovation",
        "goal": "What is a popular new skincare product or technique introduced in 2023? Provide the product or technique's name, developer, and main benefits.",
        "max_similarity_score": 0.48
    },
    {
        "name": "cryptocurrency_news",
        "goal": "What is the latest news regarding a popular cryptocurrency? Provide a brief summary of the news and its potential impact on the cryptocurrency market.",
        "max_similarity_score": 0.5
    },
    {
        "name": "climate_change_solution",
        "goal": "What innovative solution to combat climate change has been recently proposed or implemented? Describe the solution and its potential effects in a few sentences.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "health_advancement",
        "goal": "What is a significant health care advancement or discovery made in April 2023? Describe the advancement or discovery and its implications briefly.",
        "max_similarity_score": 0.4444444444444444
    },
    {
        "name": "historical_anniversary",
        "goal": "What major historical event is having its anniversary this month? Provide the event's name, the date of the anniversary, and a brief summary of the event's significance.",
        "max_similarity_score": 0.3859649122807017
    },
    {
        "name": "artistic_collaboration",
        "goal": "What recent art collaboration or partnership has gained attention in 2023? Provide the name of the collaborative project, participant artists, and a brief overview of the project.",
        "max_similarity_score": 0.4230769230769231
    },
    {
        "name": "entrepreneurs_success",
        "goal": "Who are the two young entrepreneurs who've recently made their mark in the tech industry? Provide their names, their startup, and a brief description of the startup's purpose.",
        "max_similarity_score": 0.33333333333333326
    },
    {
        "name": "polar_research",
        "goal": "What new polar research has been recently published, providing new insights in April 2023? Describe the nature of the research and its implications briefly.",
        "max_similarity_score": 0.5
    },
    {
        "name": "cybersecurity_update",
        "goal": "What is a recent cybersecurity threat or breach reported in April 2023? Provide a brief summary of the incident and the affected parties.",
        "max_similarity_score": 0.4680851063829787
    },
    {
        "name": "sports_comeback",
        "goal": "What is the most memorable sports comeback that took place in April 2023? Provide the name of the athlete or team, and a brief summary of the event.",
        "max_similarity_score": 0.49122807017543857
    },
    {
        "name": "music_concert",
        "goal": "Find an upcoming live concert in New York City featuring a popular rock band within the next month. Provide the date, venue, and a link to purchase tickets.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "job_opportunities",
        "goal": "Identify three reputable companies with job openings for software engineers in San Francisco, California. Include the job titles, required qualifications, and a link to apply.",
        "max_similarity_score": 0.4255319148936171
    },
    {
        "name": "nutrition_advisor",
        "goal": "Suggest a healthy and balanced vegetarian meal plan for a day, including breakfast, lunch, dinner, and two snacks. Provide recipe links or guidelines for each meal.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "language_learner",
        "goal": "Recommend three popular language learning apps with a focus on learning Mandarin Chinese. Include a brief description and notable features of each app.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "solar_panels",
        "goal": "Identify the top three solar panel manufacturers in the United States. Include the company names, headquarters locations, and notable products.",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "climate_change",
        "goal": "What are the latest updates on global climate change and its impact on sea-level rise projections for the year 2100?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "hiking_trails",
        "goal": "Recommend three scenic hiking trails near Asheville, North Carolina suitable for beginners. Provide a short description, distance, and difficulty level for each trail.",
        "max_similarity_score": 0.3404255319148936
    },
    {
        "name": "electric_car_charging",
        "goal": "Locate three electric vehicle charging stations near downtown Los Angeles. Include the addresses and the type of charger.",
        "max_similarity_score": 0.3
    },
    {
        "name": "stock_market_investor",
        "goal": "What are the top-performing stocks in the technology industry over the past six months? Provide the stock ticker symbols, company names, and percentage gains.",
        "max_similarity_score": 0.4081632653061225
    },
    {
        "name": "gardening_helper",
        "goal": "Suggest three flowering plants suitable for a small garden in a temperate climate that bloom in the summer. Include the plant names, care instructions, and blooming time.",
        "max_similarity_score": 0.29787234042553196
    },
    {
        "name": "workout_plan",
        "goal": "Create a week-long workout plan for someone looking to improve cardiovascular fitness, including daily routines and exercise variations.",
        "max_similarity_score": 0.30434782608695654
    },
    {
        "name": "book_releases",
        "goal": "List the titles and authors of two highly anticipated books that are set to be released in the next month.",
        "max_similarity_score": 0.4571428571428572
    },
    {
        "name": "sports_scores",
        "goal": "Determine the top three NBA teams based on their current season win-loss records. List the team names and records.",
        "max_similarity_score": 0.3
    },
    {
        "name": "artistic_awards",
        "goal": "Which artist or artwork recently won a prestigious art award? Include the name of the award, the winner, and a brief description of their work.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "fashion_designer",
        "goal": "Identify an emerging fashion designer who is making waves in the industry. Provide their name and a link to their most recent collection.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "mountain_climber",
        "goal": "Name the most recent individual who has successfully climbed all 14 of the world's 8,000-meter peaks. When did they achieve this feat?",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "new_apps",
        "goal": "Find a newly released mobile app that can help users manage their tasks and to-do lists more efficiently. Include the app's name, description, and link to its download page.",
        "max_similarity_score": 0.3793103448275862
    },
    {
        "name": "culinary_award",
        "goal": "Which restaurant recently received the highest rating in the Michelin Guide? Include the name, location, and what rating it achieved.",
        "max_similarity_score": 0.4390243902439024
    },
    {
        "name": "environmental_innovation",
        "goal": "Find an example of a new environmental technology or initiative that has the potential to greatly reduce environmental damage. Detail the innovation and its potential effects.",
        "max_similarity_score": 0.4
    },
    {
        "name": "archeological_find",
        "goal": "Identify a recent archeological discovery that has changed our understanding of a particular historical period. Describe the find and its implications.",
        "max_similarity_score": 0.45
    },
    {
        "name": "car_launches",
        "goal": "When is the next major car model unveiling by an internationally renowned automobile manufacturer? Include the event's date, location, and the manufacturer's name.",
        "max_similarity_score": 0.3181818181818182
    },
    {
        "name": "business_acquisition",
        "goal": "Which major company recently acquired another large corporation? Provide the names of both companies and a brief analysis of the acquisition's implications.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "stock_splits",
        "goal": "Determine which stock from the S&P 500 recently experienced a stock split. Specify the stock, the split ratio, and the announcement date.",
        "max_similarity_score": 0.27777777777777773
    },
    {
        "name": "cyber_security",
        "goal": "Report on a recent cyber security incident involving a major corporation. Include the company name, date of the attack, and a summary of the breach.",
        "max_similarity_score": 0.4074074074074074
    },
    {
        "name": "travel_destination",
        "goal": "Find a recently popular tourist destination that has become a must-see for travelers. Detail its location, attractions, and an estimate of visitor numbers.",
        "max_similarity_score": 0.27906976744186046
    },
    {
        "name": "vaccine_availability",
        "goal": "When and where will the next COVID-19 vaccine distribution event be held in Boston? Provide the date, time, and location for the public.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "celebrity_birthdays",
        "goal": "Which famous actor or actress is celebrating their birthday today? List their name, age, and most famous roles.",
        "max_similarity_score": 0.45161290322580644
    },
    {
        "name": "political_elections",
        "goal": "What is the most recent major election that took place in the world? Specify the country, date, and the elected candidate or political party.",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "space_exploration",
        "goal": "Which mission recently discovered water on a celestial body in our solar system? Provide the mission's name, date of the discovery, and its potential significance.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "animal_discovery",
        "goal": "Identify a newly discovered animal species that has been recently described in a scientific journal. Provide its name, brief description, and habitat.",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "new_legislation",
        "goal": "What is a recently passed or proposed law in the United States that has significant implications? Detail the law's name, its key provisions, and expected outcome.",
        "max_similarity_score": 0.4583333333333333
    },
    {
        "name": "economic_news",
        "goal": "Report on a recent development in the global economic landscape that could have far-reaching consequences. Summarize the event and its potential impact.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "renewable_energy",
        "goal": "Which country recently set a new record for renewable energy production? Specify the country, date, and type of renewable energy involved.",
        "max_similarity_score": 0.37499999999999994
    },
    {
        "name": "climate_milestone",
        "goal": "What recent climate milestone has the world achieved related to carbon emissions or global temperature? Detail the milestone and its significance.",
        "max_similarity_score": 0.3111111111111111
    },
    {
        "name": "artificial_intelligence",
        "goal": "Identify a recent development in artificial intelligence that has the potential to revolutionize the field. Describe the innovation, its potential applications, and impact.",
        "max_similarity_score": 0.4680851063829787
    },
    {
        "name": "notable_births",
        "goal": "Which famous person recently became a parent? List their name, child's name, and birth date.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "world_records",
        "goal": "Which world record was recently broken and by whom? Provide the new record's details, the previous record, and the individuals involved.",
        "max_similarity_score": 0.33333333333333326
    },
    {
        "name": "charity_event",
        "goal": "When and where is the next high-profile charity event taking place? List the event's name, date, location, and the charitable cause.",
        "max_similarity_score": 0.4583333333333333
    },
    {
        "name": "religious_festival",
        "goal": "What is the next major religious festival or celebration occurring worldwide? Specify the festival's name, date, and which religion it is associated with.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "upcoming_concerts",
        "goal": "What are three major upcoming concerts in New York City happening in June 2023? Provide the names of the performers, the venues, and the dates of the concerts.",
        "max_similarity_score": 0.4150943396226415
    },
    {
        "name": "top_colleges",
        "goal": "What are the top three colleges in the United States, ranked by overall score in the 2023 US News and World Report rankings? Provide the names and the ranking details.",
        "max_similarity_score": 0.4081632653061224
    },
    {
        "name": "covid_update",
        "goal": "What are the latest updates regarding COVID-19 cases and vaccine development?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "award_winners",
        "goal": "Who were the winners of the 2023 Academy Awards for Best Actor and Best Actress? Include the name of the actors and the movies they starred in.",
        "max_similarity_score": 0.5
    },
    {
        "name": "climate_change_impacts",
        "goal": "What are three significant recent climate change events that occurred around the world? Explain each event and its effects.",
        "max_similarity_score": 0.35
    },
    {
        "name": "art_festival",
        "goal": "Identify three major upcoming art festivals or events happening in 2023 worldwide. Provide details about the event, location, and dates.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "electric_vehicles",
        "goal": "What are the top three electric vehicle models released in 2023 based on range, performance, and price? Provide model names, specifications, and a brief overview of each vehicle.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "fashion_trends",
        "goal": "What are the most significant fashion trends in spring 2023 and the key designers leading these trends? Provide a brief description and examples.",
        "max_similarity_score": 0.3773584905660377
    },
    {
        "name": "food_recalls",
        "goal": "Are there any ongoing food recalls in the United States? Provide details about the products, the reason for the recall, and the dates.",
        "max_similarity_score": 0.4
    },
    {
        "name": "job_market",
        "goal": "What is the current unemployment rate in the United States, and which industries are experiencing significant growth or decline?",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "travel_restrictions",
        "goal": "What are the current travel restrictions for US citizens traveling internationally due to the COVID-19 pandemic?",
        "max_similarity_score": 0.39024390243902435
    },
    {
        "name": "historical_anniversary",
        "goal": "What significant historical anniversaries occur in May 2023? Provide a brief description of the event and its importance.",
        "max_similarity_score": 0.4390243902439025
    },
    {
        "name": "new_restaurants",
        "goal": "Identify three recently opened popular restaurants in Los Angeles, with cuisine types and the addresses.",
        "max_similarity_score": 0.3414634146341463
    },
    {
        "name": "latest_smartphones",
        "goal": "What are the most recently released flagship smartphones from Apple, Samsung, and Google? Provide model names, release dates, and key features.",
        "max_similarity_score": 0.3673469387755102
    },
    {
        "name": "cryptocurrency_prices",
        "goal": "What are the current prices of Bitcoin, Ethereum, and Binance Coin in USD?",
        "max_similarity_score": 0.4999999999999999
    },
    {
        "name": "endangered_species",
        "goal": "What are three recently defined endangered species, as announced by the IUCN Red List in 2023?",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "international_holidays",
        "goal": "What are three unique national holidays celebrated in countries outside of the United States in May 2023?",
        "max_similarity_score": 0.5
    },
    {
        "name": "athlete_records",
        "goal": "Which athlete recently broke a world record in their respective sport and what was the record they broke?",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "new_tv_shows",
        "goal": "What are three highly anticipated new TV shows premiering in May 2023? Provide the premise, cast details, and the network it will air on.",
        "max_similarity_score": 0.4081632653061225
    },
    {
        "name": "political_elections",
        "goal": "What significant political elections are scheduled for 2023? Provide details about the countries involved and the candidates, if known.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "latest_business_mergers",
        "goal": "What are three recently announced business mergers or acquisitions in 2023? Provide the companies involved and a brief explanation of the deal.",
        "max_similarity_score": 0.44897959183673464
    },
    {
        "name": "environmental_efforts",
        "goal": "What are recent innovations or efforts by companies to reduce their environmental impact? Describe three examples.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "real_estate_market",
        "goal": "What are the current trends in the US real estate market, including home prices and mortgage rates?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "minimum_wage_changes",
        "goal": "Have there been any changes to the minimum wage laws in the United States in 2023? Provide details on any changes and the affected states.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "cybersecurity_incidents",
        "goal": "What are three recent major cybersecurity incidents that took place in the first quarter of 2023? Provide a brief overview of each incident and its consequences.",
        "max_similarity_score": 0.44897959183673475
    },
    {
        "name": "film_festivals",
        "goal": "What are the upcoming major film festivals in 2023, their locations, and dates?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "long_running_tv_shows",
        "goal": "Which three TV series are currently the longest-running shows on air in the United States?",
        "max_similarity_score": 0.3703703703703703
    },
    {
        "name": "marathon_schedule",
        "goal": "When is the next Boston Marathon scheduled? Provide the date and any relevant registration details.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "electric_car",
        "goal": "Find me the latest electric car models with a range of at least 300 miles per charge. List the top three options with their price.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "job_openings",
        "goal": "Identify currently available graphic design job opportunities in Canada. Share at least three openings.",
        "max_similarity_score": 0.2631578947368421
    },
    {
        "name": "space_launch",
        "goal": "What are the upcoming rocket launches from SpaceX? Provide the date and mission details.",
        "max_similarity_score": 0.4137931034482759
    },
    {
        "name": "restaurant_finder",
        "goal": "Find me the top 3 highly-rated vegan restaurants in New York City.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "art_exhibition",
        "goal": "Are there any modern art exhibitions happening in Paris this month? Mention the venue and event details.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "tech_conference",
        "goal": "List upcoming tech conferences focused on Artificial Intelligence within the next three months.",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "book_releases",
        "goal": "What are the most anticipated fiction book releases for next month? Mention at least three titles and their authors.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "gaming_tournament",
        "goal": "When is the next major Esports tournament, and which game will it feature? Provide the date and event name.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "car_sales_analysis",
        "goal": "Which car brand had the highest sales in the US last year? Provide the approximate number of cars sold.",
        "max_similarity_score": 0.4878048780487805
    },
    {
        "name": "volcano_activity",
        "goal": "Has there been any recent volcanic activity in Hawaii? Share information about eruptions or alerts.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "fitness_challenge",
        "goal": "What are some popular fitness challenges or events scheduled for June this year?",
        "max_similarity_score": 0.4
    },
    {
        "name": "crime_statistics",
        "goal": "What was the crime rate in Chicago during 2022? Specify violent and non-violent crime statistics.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "best_birthday_destination",
        "goal": "Find me an ideal location for celebrating a birthday party in Los Angeles, considering both adults and kids.",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "internet_speed",
        "goal": "Which country has the fastest average internet speed as of 2023?",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "language_school",
        "goal": "Where can I find highly-rated Japanese language schools in Tokyo for foreign students?",
        "max_similarity_score": 0.4
    },
    {
        "name": "water_crisis",
        "goal": "Is there any ongoing water crisis reported in California? Mention the cause and current situation.",
        "max_similarity_score": 0.37500000000000006
    },
    {
        "name": "hiking_trail_finder",
        "goal": "Find me the top-rated hiking trails in Yosemite National Park suitable for beginners.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "national_parks",
        "goal": "Which national park had the most visitors in the US in 2022?",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "bestselling_author",
        "goal": "Who is the bestselling fiction author of the past year?",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "opera_performance",
        "goal": "What upcoming performances are scheduled at the Metropolitan Opera House in New York?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "jazz_festival",
        "goal": "Where is the nearest Jazz Festival happening in Europe this summer?",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "organic_market",
        "goal": "Identify local organic markets or farmers' markets currently operating in Atlanta.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "coding_bootcamp",
        "goal": "Find the top 3 coding bootcamps in Boston for beginners interested in web development.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "renewable_energy",
        "goal": "Which country leads in the production of renewable energy in 2023?",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "travel_insurance",
        "goal": "What are the best travel insurance providers for a trip to Europe? Share the top 3 options.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "virtual_reality",
        "goal": "What are the latest and most popular virtual reality headsets available on the market? List the top 3 options.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "chess_championship",
        "goal": "When is the next World Chess Championship, and who will be competing?",
        "max_similarity_score": 0.48000000000000004
    },
    {
        "name": "software_update",
        "goal": "Is there any significant update released for Adobe Photoshop in 2023? If so, what are the new features?",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "stock_market_news",
        "goal": "What are the top business headlines related to the stock market today?",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "tax_consultant",
        "goal": "Find highly-rated tax consultants or firms in San Francisco specializing in small businesses.",
        "max_similarity_score": 0.32
    },
    {
        "name": "climate_change",
        "goal": "What has been the global temperature increase in comparison to the pre-industrial era?",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "architectural_awards",
        "goal": "What building or architectural project won the most recent Pritzker Architecture Prize?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "booking_discount",
        "goal": "What are some current hotel booking discounts or promotions for a weekend staycation in Miami?",
        "max_similarity_score": 0.3571428571428571
    },
    {
        "name": "coupon_deals",
        "goal": "Discover grocery coupon deals available in my area for healthy and organic products.",
        "max_similarity_score": 0.23529411764705882
    },
    {
        "name": "smartphone_comparison",
        "goal": "Compare the latest iPhone with the latest Samsung Galaxy phone in terms of their features and specifications.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "scholarship_opportunities",
        "goal": "Identify scholarship opportunities for international students to study computer science in the United States.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "data_protection_regulation",
        "goal": "What are the key aspects of the EU General Data Protection Regulation (GDPR)?",
        "max_similarity_score": 0.3636363636363637
    },
    {
        "name": "pension_plan",
        "goal": "Which pension plan has the highest return on investment over the past year? Provide a source for comparison.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "recipe_finder",
        "goal": "Give me a recipe that is vegan, gluten-free, and requires under 30 minutes to prepare.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "job_searcher",
        "goal": "What are the top 3 remote job opportunities for software engineers with a salary of at least $110,000 per year?",
        "max_similarity_score": 0.38095238095238093
    },
    {
        "name": "real_estate_analyzer",
        "goal": "Give me the details of three houses for sale in San Francisco with at least 3 bedrooms and within a budget of $1.5 million.",
        "max_similarity_score": 0.32558139534883723
    },
    {
        "name": "tech_news",
        "goal": "What is the latest technology development concerning electric vehicles? Give me up-to-date news.",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "vacation_planner",
        "goal": "Suggest three all-inclusive vacation packages to the Maldives for June 2023.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "medical_research",
        "goal": "What is the most recent breakthrough in Alzheimer's disease research? Give me up-to-date information.",
        "max_similarity_score": 0.5
    },
    {
        "name": "cryptocurrency_tracker",
        "goal": "What is the current market capitalization ranking of the top 5 cryptocurrencies?",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "legislative_updates",
        "goal": "What is the status of the Digital Services Act legislation in the European Union? Provide the latest update.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "college_rankings",
        "goal": "What are the top 3 bachelor degree programs in computer engineering according to US News & World Report's 2023 ranking?",
        "max_similarity_score": 0.4
    },
    {
        "name": "public_event_rsvp",
        "goal": "Find an upcoming public event in Chicago that requires an RSVP. Give me the date, time, and registration details.",
        "max_similarity_score": 0.4444444444444444
    },
    {
        "name": "covid_vaccine_distributor",
        "goal": "Which company is the primary distributor of the COVID-19 vaccine in the United States as of April 2023?",
        "max_similarity_score": 0.47368421052631576
    },
    {
        "name": "ecommerce_sale_finder",
        "goal": "Find an upcoming sale or discount on the latest gaming laptops. Give me details on the models and discount percentages.",
        "max_similarity_score": 0.358974358974359
    },
    {
        "name": "small_business_grants",
        "goal": "What is a current grant opportunity for small businesses in the United States? Provide application requirements and deadlines.",
        "max_similarity_score": 0.43243243243243246
    },
    {
        "name": "airline_promotions",
        "goal": "Find any ongoing promotions for flights between New York and Los Angeles in June 2023.",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "pollution_monitor",
        "goal": "What is the current air quality index of Los Angeles, California?",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "grocery_food_recall",
        "goal": "Has there been a recent food recall affecting any grocery products in the United States? If so, what item was recalled?",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "endangered_species_update",
        "goal": "What is the latest update on efforts to save the Amazon rainforest's endangered species? Give me recent news.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "art_exhibit",
        "goal": "Find information on a new contemporary art exhibit opening in London during May 2023.",
        "max_similarity_score": 0.3448275862068965
    },
    {
        "name": "biodiversity_conference",
        "goal": "Give me the latest information on the United Nations Biodiversity Conference in 2023, including the dates and main themes.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "agriculture_report",
        "goal": "What is the latest news on farming technology advancements that increase crop yields?",
        "max_similarity_score": 0.4545454545454546
    },
    {
        "name": "construction_project_announcement",
        "goal": "What is a recently announced major construction project in the United States? Give me the location and project description.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "tax_policy_update",
        "goal": "What is the latest update on the United States federal income tax policy for 2023? Provide any important changes or deadlines.",
        "max_similarity_score": 0.4
    },
    {
        "name": "animal_rights_advocacy",
        "goal": "What is a recent achievement made by a prominent animal rights advocacy group? Give me up-to-date information.",
        "max_similarity_score": 0.5
    },
    {
        "name": "new_retail_store",
        "goal": "Tell me about a new retail store that opened in New York City this month. Give me the name, location, and what they sell.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "public_transportation_expansion",
        "goal": "What is the latest news on public transportation expansion projects in Los Angeles, California?",
        "max_similarity_score": 0.4799999999999999
    },
    {
        "name": "renewable_energy_goal",
        "goal": "What is the European Union's renewable energy target for 2025? Give me the percentage of energy expected to come from renewable sources.",
        "max_similarity_score": 0.3529411764705882
    },
    {
        "name": "humanitarian_project",
        "goal": "Find details about a current major humanitarian project addressing a crisis in Africa. Give me the organization behind the project and their efforts.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "online_privacy_regulation",
        "goal": "What is a prominent online privacy regulation recently enacted or updated in the European Union?",
        "max_similarity_score": 0.3888888888888889
    },
    {
        "name": "space_exploration_news",
        "goal": "What is the latest news on a manned mission to Mars? Provide recent updates on any progress or plans.",
        "max_similarity_score": 0.4375
    },
    {
        "name": "electric_vehicle_infrastructure",
        "goal": "Give me information on a recently announced plan for expanding the electric vehicle charging infrastructure in the United States.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "recent_book_awards",
        "goal": "Who are the winners of the 2023 Pulitzer Prizes for Fiction and Nonfiction? Give me the titles and authors.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "mobile_app_launch",
        "goal": "Find a recently launched mobile app that focuses on mental health and wellness. Give me the name, description, and available platforms.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "adventure_tourism_offer",
        "goal": "What is a popular adventure tourism package recently introduced for the summer of 2023? Give me the destination and details.",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "social_initiative",
        "goal": "What is a new corporate social responsibility initiative recently announced by a top technology company?",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "library_anniversary",
        "goal": "Which prominent library is celebrating its anniversary in 2023? Give me the name, location, and details for the event.",
        "max_similarity_score": 0.45
    },
    {
        "name": "satellite_launch",
        "goal": "What is the latest news on a satellite launch for Earth observation? Give me the details of the satellite and scheduled launch.",
        "max_similarity_score": 0.3913043478260869
    },
    {
        "name": "water_quality_study",
        "goal": "What is the latest news regarding the water quality of the Great Barrier Reef in Australia? Provide any recent studies or results.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "wildlife_protection",
        "goal": "What is a recent news story about a successful wildlife protection effort? Give me the location and species involved.",
        "max_similarity_score": 0.42105263157894735
    },
    {
        "name": "eco_friendly_packaging",
        "goal": "What is a recent innovation in eco-friendly packaging materials? Give me information on the new material and its potential benefits.",
        "max_similarity_score": 0.4186046511627907
    },
    {
        "name": "upcoming_concert",
        "goal": "Identify an upcoming rock concert in London within the next month. Provide the name of the band, the venue, and the date.",
        "max_similarity_score": 0.4799999999999999
    },
    {
        "name": "recent_scientific_discovery",
        "goal": "Describe a recent scientific discovery or breakthrough that has been making headlines. Include the researchers' names, institution, and a summary of their findings.",
        "max_similarity_score": 0.37209302325581395
    },
    {
        "name": "marathon_preparation",
        "goal": "Propose a 12-week training plan for a beginner who wants to run a marathon. Make sure the plan is based on credible sources.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "cat_adoption",
        "goal": "Find a nearby cat adoption center in Los Angeles, California. Provide the center's name, address, phone number, and operation hours.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "museum_trip",
        "goal": "Recommend a noteworthy art museum in Madrid, Spain. Include the museum's name, address, and a brief description of its main attractions.",
        "max_similarity_score": 0.4897959183673469
    },
    {
        "name": "language_to_learn",
        "goal": "What is the most useful second language to learn for someone working in the tech industry? Provide reasons and benefits for learning this language.",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "marketing_seminar",
        "goal": "Locate an upcoming marketing seminar relevant to small business owners. Mention the event's name, location, date, and how to register.",
        "max_similarity_score": 0.35
    },
    {
        "name": "colleges_comparison",
        "goal": "Compare the computer science programs at MIT and Stanford University. Provide the differences and similarities between the two programs.",
        "max_similarity_score": 0.3076923076923077
    },
    {
        "name": "app_idea",
        "goal": "Come up with a unique app idea that would help people track their carbon footprint and encourage sustainable habits. Summarize the app's key features.",
        "max_similarity_score": 0.3214285714285714
    },
    {
        "name": "TEDtalk_watch",
        "goal": "Identify an inspiring TED talk from a well-known innovator. Provide the title, speaker, and a brief description of the theme.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "climate_change_effect",
        "goal": "Summarize a recent study illustrating the effects of climate change on polar ice caps. Mention the researchers' names, institution, and main findings.",
        "max_similarity_score": 0.43243243243243246
    },
    {
        "name": "ethical_fashion",
        "goal": "Suggest three sustainable and ethical clothing brands available for online shopping. Provide the brand names and their websites.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "social_media_trend",
        "goal": "Describe a new social media trend that has become popular in the last few weeks. Include the platform and a brief explanation of the trend.",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "local_craft_beer",
        "goal": "Recommend a locally brewed craft beer from Portland, Oregon. Provide the beer's name, brewery, and a description of its flavor profile.",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "job_market",
        "goal": "What are the fastest-growing job sectors in the United States in 2023? List three industries and their expected growth rates.",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "next_vacation",
        "goal": "Suggest an affordable travel destination in Southeast Asia for a two-week vacation. Describe the main attractions and provide a rough budget estimate.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "environmental_initiative",
        "goal": "Identify a current environmental initiative being implemented to combat climate change. Provide the initiative's name, a brief description, and who is involved.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "remote_workspaces",
        "goal": "Find three coworking spaces in Berlin, Germany that cater to remote workers. Include each space's name, address, and features.",
        "max_similarity_score": 0.358974358974359
    },
    {
        "name": "local_volunteering",
        "goal": "Locate a volunteer opportunity in San Francisco, California that focuses on helping the homeless. Include the organization's name, address, and requirements for volunteers.",
        "max_similarity_score": 0.375
    },
    {
        "name": "next_technology",
        "goal": "Predict the next major technological advancement that will transform everyday life. Justify your rationale based on current trends and developments.",
        "max_similarity_score": 0.25641025641025644
    },
    {
        "name": "wildlife_experience",
        "goal": "Recommend a wildlife conservation center or sanctuary in South Africa where one can have an up-close experience with elephants. Include the center's name, location, and a summary of its activities.",
        "max_similarity_score": 0.4074074074074074
    },
    {
        "name": "green_architecture",
        "goal": "Describe a recent example of green architecture that is considered sustainable and innovative. Mention the building's name, location, and unique features.",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "esports_news",
        "goal": "Report on a recent significant event in the world of esports. Provide the event's name, the teams involved, and the outcome.",
        "max_similarity_score": 0.4
    },
    {
        "name": "urban_gardening",
        "goal": "Find an urban gardening project or rooftop garden in Chicago, Illinois. Provide the project's name, location, and a summary of its objectives.",
        "max_similarity_score": 0.4
    },
    {
        "name": "mental_health_care",
        "goal": "Identify a mental health care center in Toronto, Canada that specializes in anxiety disorders. Include the center's name, address, and services offered.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "sustainable_practices",
        "goal": "List three sustainable practices that individuals can incorporate into their daily lives to reduce their environmental impact.",
        "max_similarity_score": 0.3870967741935484
    },
    {
        "name": "virtual_reality_game",
        "goal": "Suggest a virtual reality game that offers a thrilling adventure experience. Provide the game's name, platform, and a brief description of the gameplay.",
        "max_similarity_score": 0.4313725490196078
    },
    {
        "name": "lifelong_learning",
        "goal": "Find an online course platform that offers opportunities for lifelong learning. Describe the platform's main features and the range of courses available.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "workspace_organizer",
        "goal": "Design a workspace organizer that maximizes productivity and minimizes clutter. Describe the organizer's key features and dimensions.",
        "max_similarity_score": 0.32558139534883723
    },
    {
        "name": "renewable_energy",
        "goal": "Which country has made the most significant advancements in renewable energy production recently? Provide details on the country's progress and renewable energy sources.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "upcoming_space_mission",
        "goal": "Describe an upcoming space mission that is expected to yield groundbreaking discoveries. Mention the mission's name, objectives, and involved organizations.",
        "max_similarity_score": 0.38095238095238093
    },
    {
        "name": "pet_hotel",
        "goal": "Find a luxury pet hotel in Melbourne, Australia, where pet owners can board their dogs. Include the hotel's name, address, and services provided.",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "new_car_investment",
        "goal": "Identify a newly released electric vehicle model that combines performance, style, and affordability. Provide the car's name, manufacturer, and key features.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "crowdfunding_project",
        "goal": "Discover a compelling and successful crowdfunding project recently funded. Describe the project's name, funding goals, and the product or service being proposed.",
        "max_similarity_score": 0.3255813953488372
    },
    {
        "name": "international_festival",
        "goal": "Recommend an international cultural festival that will be happening this year and is known for its vibrant atmosphere. Mention the festival's name, location, and dates.",
        "max_similarity_score": 0.34782608695652173
    },
    {
        "name": "national_park_adventure",
        "goal": "Suggest a lesser-known national park in the United States for a hiking and camping adventure. Provide the park's name, location, and unique features.",
        "max_similarity_score": 0.4
    },
    {
        "name": "emerging_artist",
        "goal": "Identify an emerging visual artist who has been receiving critical acclaim recently. Describe their unique style, themes, and notable works.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "smart_home_technology",
        "goal": "Research an innovative smart home technology that offers convenience, security, and energy efficiency. Mention the product's name, maker, and key features.",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "adventure_sports",
        "goal": "Recommend an adventure sport experience for thrill-seekers in Queenstown, New Zealand. Include the sport's name, location, and a brief description of the activity.",
        "max_similarity_score": 0.46808510638297873
    },
    {
        "name": "tech_conference",
        "goal": "Find an upcoming cutting-edge technology conference taking place in Singapore. Provide the conference's name, dates, and topics to be discussed.",
        "max_similarity_score": 0.4186046511627907
    },
    {
        "name": "food_delivery_solution",
        "goal": "Describe a recent technological solution that helps to improve the efficiency and sustainability of food delivery services. Mention the solution's creator, features, and benefits.",
        "max_similarity_score": 0.3829787234042554
    },
    {
        "name": "job_opportunities",
        "goal": "Find a list of three companies in Chicago that are currently hiring for software developer positions.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "tech_conference_locator",
        "goal": "What are the dates and locations for three major technology conferences happening in the next three months?",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "science_news",
        "goal": "Provide a summary of an important scientific discovery that occurred within the past week.",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "book_releases",
        "goal": "Tell me about three new bestselling fiction books that were released this month.",
        "max_similarity_score": 0.3783783783783784
    },
    {
        "name": "movie_suggestions",
        "goal": "Recommend three highly-rated movies currently playing in theaters, providing the movie titles and release dates.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "college_rankings",
        "goal": "Provide the top five colleges for computer science in the United States according to the latest rankings.",
        "max_similarity_score": 0.45161290322580644
    },
    {
        "name": "sports_scores",
        "goal": "What were the scores of the three most recent Major League Baseball games?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "best_local_gym",
        "goal": "Find a highly-reviewed gym in Los Angeles with various classes and membership options.",
        "max_similarity_score": 0.375
    },
    {
        "name": "local_election_results",
        "goal": "Who won the most recent mayoral election in San Francisco? What percentage of the vote did they receive?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "nature_reserve",
        "goal": "Which national parks or nature reserves are currently open for visitors near Denver, Colorado?",
        "max_similarity_score": 0.2758620689655172
    },
    {
        "name": "hotel_booking",
        "goal": "Find a luxury hotel in Miami that has available rooms for the weekend of May 15-17, 2023.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "theater_performance",
        "goal": "What are three Broadway shows currently playing in New York City? Include the theater name and showtimes for each.",
        "max_similarity_score": 0.5
    },
    {
        "name": "museum_exhibits",
        "goal": "Which museums in London have special art exhibits on display this month?",
        "max_similarity_score": 0.27586206896551724
    },
    {
        "name": "public_transport",
        "goal": "What is the fastest public transport route from Central Park to the Statue of Liberty in New York City?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "environmental_advancement",
        "goal": "Provide information about one significant development in renewable energy that has happened this year.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "cooking_class_locator",
        "goal": "Recommend a cooking class in Austin, Texas, specializing in Thai cuisine. Include the location and contact information.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "language_learning",
        "goal": "Which language schools in London offer intensive Spanish courses? Provide three options, including course dates and fees.",
        "max_similarity_score": 0.25
    },
    {
        "name": "notable_biographies",
        "goal": "Give a brief summary of the life and achievements of a notable person who recently passed away.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "car_reviewer",
        "goal": "Which electric vehicle models received the highest safety ratings this year? Provide the top three choices.",
        "max_similarity_score": 0.45161290322580644
    },
    {
        "name": "cultural_festival_events",
        "goal": "List three cultural festivals happening within the next two months in Los Angeles.",
        "max_similarity_score": 0.38461538461538464
    },
    {
        "name": "historical_anniversary",
        "goal": "What is a significant historical event that is celebrating its anniversary today?",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "famous_landmark",
        "goal": "What is an iconic landmark in Paris that a first-time visitor should not miss?",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "concert_finder",
        "goal": "What are the upcoming tour dates for Adele? Include the venue names and cities.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "fitness_challenge",
        "goal": "Find a local or virtual 5K race that is happening next month in San Francisco.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "charity_opportunities",
        "goal": "Provide three reputable non-profit organizations focused on animal welfare, and explain how to donate to each.",
        "max_similarity_score": 0.22857142857142856
    },
    {
        "name": "social_media_trends",
        "goal": "What is a viral challenge or trend currently circulating on social media platforms like TikTok or Instagram?",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "travel_blog_recommendations",
        "goal": "Which travel blogs provide the best information on budget travel across Europe? Give three popular choices.",
        "max_similarity_score": 0.3125
    },
    {
        "name": "new_business_opening",
        "goal": "What is a newly opened restaurant or cafe in Washington, D.C., that is gaining positive reviews? Include its address and a brief description.",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "tropical_vacation_suggestions",
        "goal": "Recommend three beach destinations in the Caribbean that are popular for their all-inclusive resorts.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "education_policy_changes",
        "goal": "What is a recent change to the education policy of the United States that could have long-term impacts?",
        "max_similarity_score": 0.47058823529411764
    },
    {
        "name": "fashion_industry_news",
        "goal": "What is a hot trend or notable event from the world of fashion this week?",
        "max_similarity_score": 0.3571428571428571
    },
    {
        "name": "human_rights_issues",
        "goal": "What is a major ongoing human rights issue that is currently being addressed by the United Nations?",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "political_summit_event",
        "goal": "Give details on an upcoming political summit or conference focused on climate change.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "wildlife_migration_pattern",
        "goal": "Describe a notable wildlife migration phenomenon that occurs annually, including the species involved and its location.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "poetry_competition",
        "goal": "What is an upcoming poetry competition open to the public? Include entry requirements and submission deadlines.",
        "max_similarity_score": 0.35294117647058826
    },
    {
        "name": "cultural_trip_planning",
        "goal": "Suggest a week-long cultural trip in Spain, highlighting key cities and their popular attractions.",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "best_mobile_apps",
        "goal": "What are the three top-rated mobile apps in the health and fitness category this year?",
        "max_similarity_score": 0.411764705882353
    },
    {
        "name": "online_courses",
        "goal": "Find three free online courses on Python programming for beginners.",
        "max_similarity_score": 0.4347826086956522
    },
    {
        "name": "renewable_energy_projects",
        "goal": "What is a large-scale renewable energy project currently under construction in Europe?",
        "max_similarity_score": 0.4545454545454546
    },
    {
        "name": "medical_breakthrough",
        "goal": "Tell me about a groundbreaking medical breakthrough that has happened within the last month.",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "famous_paintings",
        "goal": "Identify three famous paintings and their respective painters. Provide a brief description of each painting and why they are significant.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "local_coffee",
        "goal": "Locate a highly rated coffee shop in Austin, Texas. Give me the name, address, and some popular menu items.",
        "max_similarity_score": 0.47368421052631576
    },
    {
        "name": "renowned_scientist",
        "goal": "Who is a renowned scientist currently making groundbreaking discoveries in their field? Briefly describe their most significant contribution.",
        "max_similarity_score": 0.34146341463414637
    },
    {
        "name": "top_anime_series",
        "goal": "List three top-rated anime series from the last year. Include a short synopsis and the name of the studio that produced the series.",
        "max_similarity_score": 0.27450980392156865
    },
    {
        "name": "nature_photography",
        "goal": "Find a reputable nature photography contest and detail the entry requirements, deadline, and prizes available.",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "android_app",
        "goal": "What is a trending Android app for improving productivity? Describe its main features and provide a link to download it from the Google Play Store.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "essential_skill",
        "goal": "What is an essential skill to learn for a successful career in software development? Describe its importance and how it can be learned.",
        "max_similarity_score": 0.2978723404255319
    },
    {
        "name": "renowned_chef",
        "goal": "Who is a renowned chef that has recently released a new cookbook? Provide the title of the book and a brief overview of the recipes featured.",
        "max_similarity_score": 0.43999999999999995
    },
    {
        "name": "solar_system",
        "goal": "Find the latest remarkable discovery made about our solar system. Briefly explain its significance and which space agency conducted the research.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "fitness_challenge",
        "goal": "Discover a popular 30-day fitness challenge and outline what it involves, as well as any necessary equipment or prerequisites.",
        "max_similarity_score": 0.23529411764705882
    },
    {
        "name": "food_trend",
        "goal": "Identify a current food trend and describe what it consists of, along with its origin and any potential health benefits.",
        "max_similarity_score": 0.28571428571428564
    },
    {
        "name": "famous_inventions",
        "goal": "List three groundbreaking inventions from the past century and the inventors responsible for them. Briefly describe their impact on society.",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "new_gaming_console",
        "goal": "Provide information about a recently released gaming console, its key features, and a popular game that is compatible with it.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "underwater_exploration",
        "goal": "Describe an ongoing underwater exploration mission and its objectives, as well as the organization responsible for it and any noteworthy findings so far.",
        "max_similarity_score": 0.23255813953488372
    },
    {
        "name": "climate_change_adaptation",
        "goal": "Find an example of an innovative adaptation strategy implemented in a city to combat climate change. Describe its purpose and efficacy.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "e-sports_update",
        "goal": "Identify a recent e-sports tournament, its winner, and the game played. Include notable moments or highlights and the cash prize awarded to the winner.",
        "max_similarity_score": 0.2857142857142857
    },
    {
        "name": "oscar_nominee_search",
        "goal": "List the nominees for Best Actor and Best Actress at the upcoming Oscar Awards ceremony, including the movie they are nominated for.",
        "max_similarity_score": 0.40816326530612246
    },
    {
        "name": "upcoming_movie_trailers",
        "goal": "What are the top three upcoming movies to be released in the next two months? Provide a brief synopsis and release date for each of them.",
        "max_similarity_score": 0.4680851063829788
    },
    {
        "name": "natural_disaster_update",
        "goal": "Report on the latest natural disaster event that occurred within the past week, including its location, casualties, and damages.",
        "max_similarity_score": 0.4666666666666667
    },
    {
        "name": "art_auction_news",
        "goal": "What artwork recently set a new record for the highest price at auction? Provide the name of the artwork, the artist, and the final sale price.",
        "max_similarity_score": 0.38461538461538464
    },
    {
        "name": "space_exploration_milestone",
        "goal": "What is the latest milestone achieved by SpaceX within the last month? Provide a description of the achievement, including any relevant dates and details.",
        "max_similarity_score": 0.375
    },
    {
        "name": "cutting_edge_technology",
        "goal": "What breakthrough technology was recently announced by a reputable source? Describe the technology and its potential applications.",
        "max_similarity_score": 0.4324324324324324
    },
    {
        "name": "political_leadership_changes",
        "goal": "What major changes in political leadership have occurred within the last month? Describe the change and its significance.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "fashion_trends",
        "goal": "What is currently trending in the world of fashion? Describe a popular style or item for the season.",
        "max_similarity_score": 0.3870967741935484
    },
    {
        "name": "sport_announcement",
        "goal": "What major sporting event announcement was made within the past week? Explain the event and why it is significant.",
        "max_similarity_score": 0.3243243243243243
    },
    {
        "name": "finance_sector_news",
        "goal": "What significant financial sector news has occurred within the past week? Describe the event and its impact.",
        "max_similarity_score": 0.5
    },
    {
        "name": "endangered_species_update",
        "goal": "Which endangered species has recently made headlines for conservation efforts or population changes? Describe the species and the current situation.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "famous_birthdays",
        "goal": "Which famous celebrity shares a birthday with Apr 30, 2023? Provide the name of the celebrity and a brief description of their accomplishments.",
        "max_similarity_score": 0.4999999999999999
    },
    {
        "name": "award_winner_announcement",
        "goal": "What prestigious award was recently announced, and who is the winner? Provide the name of the award and the recipient, along with a brief description of their achievement.",
        "max_similarity_score": 0.49056603773584906
    },
    {
        "name": "celebrity_breakups",
        "goal": "Which high-profile celebrity couple recently announced their separation or divorce? Describe the couple and the reasons for their split.",
        "max_similarity_score": 0.4444444444444444
    },
    {
        "name": "travel_destination_spotlight",
        "goal": "What is a highly recommended travel destination for the upcoming summer season? Describe the location and its unique features and attractions.",
        "max_similarity_score": 0.4
    },
    {
        "name": "medical_breakthroughs",
        "goal": "What recent medical breakthrough has the potential to significantly improve human health? Describe the discovery and its potential impact.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "automotive_industry_news",
        "goal": "What is the latest news from the automotive industry, specifically regarding electric vehicles? Describe the news and its implications.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "renewable_energy_developments",
        "goal": "What is a recent notable achievement in renewable energy? Describe the achievement and its potential impact on energy production and consumption.",
        "max_similarity_score": 0.46511627906976744
    },
    {
        "name": "viral_social_media_trends",
        "goal": "What is a viral social media trend or challenge within the past week? Describe the trend and its origins.",
        "max_similarity_score": 0.5
    },
    {
        "name": "tech_product_launches",
        "goal": "What is a recently released tech gadget or product that has garnered positive reviews? Describe the product and its key features.",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "film_festival_highlights",
        "goal": "What film recently won a major award at a prominent film festival? Provide the film's title, the award it won, and a brief description.",
        "max_similarity_score": 0.44
    },
    {
        "name": "international_relations_update",
        "goal": "What is a recent development between two nations that may have a significant impact on global affairs? Describe the event and its potential ramifications.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "climate_change_news",
        "goal": "What recent event or finding related to climate change highlights the urgency or importance of addressing this issue? Describe the news and its possible implications.",
        "max_similarity_score": 0.3673469387755102
    },
    {
        "name": "animal_welfare_update",
        "goal": "What recent news story demonstrates progress in animal welfare or protection? Describe the situation and its significance.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "education_transformations",
        "goal": "What is a recent innovation in education that may transform how students learn or teachers teach? Describe the innovation and its potential impact.",
        "max_similarity_score": 0.5
    },
    {
        "name": "charitable_initiatives",
        "goal": "What is a recent charitable initiative that has made a significant difference in the lives of individuals or communities? Describe the initiative and its outcomes.",
        "max_similarity_score": 0.4489795918367347
    },
    {
        "name": "television_premieres",
        "goal": "What is a highly anticipated television series that has recently premiered? Provide the series title, its cast members, and a brief synopsis.",
        "max_similarity_score": 0.4583333333333333
    },
    {
        "name": "start_up_innovations",
        "goal": "Which start-up company has recently gained traction for its innovative product or service? Describe the start-up and its product or service.",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "national_park_highlights",
        "goal": "What is a unique or noteworthy feature of a recently designated national park? Describe the park and its key attraction.",
        "max_similarity_score": 0.4390243902439024
    },
    {
        "name": "literature_anniversaries",
        "goal": "What is a classic piece of literature celebrating a significant anniversary this year? Provide the title, author, and a brief description of the work.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "space_exploration_anniversaries",
        "goal": "What significant space exploration anniversary is being celebrated this year? Describe the event and its ongoing impact on human understanding of space.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "art_restoration_projects",
        "goal": "What is a recent or ongoing art restoration project that demonstrates advances in preservation techniques? Describe the project and its significance.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "historical_sites_preservation",
        "goal": "What recently designated historical site has been preserved for future generations due to its cultural importance? Describe the site and its significance in history.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "best_restaurant",
        "goal": "What is the highest-rated restaurant in Los Angeles according to online reviews?",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "social_media_trends",
        "goal": "What are the top three current social media trends?",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "energy_utilization",
        "goal": "What are the most significant developments in alternative energy sources that are being utilized today?",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "local_music_events",
        "goal": "What are some upcoming local music events in Austin, Texas?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "wildlife_photography",
        "goal": "What are the best tips for capturing wildlife photography?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "natural_wonders",
        "goal": "Identify three natural wonders of the world that are must-visit destinations for travel enthusiasts.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "endangered_species",
        "goal": "What are three endangered species currently facing extinction threats?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "financial_analyst_advice",
        "goal": "What are the top three tips for becoming a successful financial analyst?",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "ancient_innovation",
        "goal": "What is a significant ancient innovation that has influenced the modern world?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "modern_architecture",
        "goal": "Name three iconic buildings that exhibit unique modern architecture.",
        "max_similarity_score": 0.25
    },
    {
        "name": "historic_paintings",
        "goal": "List three of the most famous and valuable paintings in history.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "unesco_world_heritage",
        "goal": "Name three UNESCO World Heritage Sites that are on the endangered list.",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "organic_farming_techniques",
        "goal": "What are three effective organic farming techniques that support sustainable agriculture practices?",
        "max_similarity_score": 0.28571428571428575
    },
    {
        "name": "best_college_campuses",
        "goal": "What are the top three college campuses known for their architectural beauty and green spaces?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "popular_travel_bloggers",
        "goal": "Who are three popular travel bloggers that inspire people to explore the world?",
        "max_similarity_score": 0.3125
    },
    {
        "name": "best_theme_parks",
        "goal": "What are the top three theme parks in the world, according to visitor satisfaction and ratings?",
        "max_similarity_score": 0.4375
    },
    {
        "name": "latest_dance_sensation",
        "goal": "What is the newest dance sensation that has become a viral phenomenon?",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "farming_innovations",
        "goal": "What are three recent farming innovations that have revolutionized the agriculture industry?",
        "max_similarity_score": 0.5
    },
    {
        "name": "underwater_hotels",
        "goal": "Name two unique underwater hotels around the world and their locations.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "upcoming_music_concerts",
        "goal": "What is the lineup for this year's Coachella music festival?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "celebrity_breakups",
        "goal": "What are two high-profile celebrity breakups announced in the past year?",
        "max_similarity_score": 0.4
    },
    {
        "name": "cat_walk_trend",
        "goal": "What are the latest fashion trends observed in the most recent fashion week?",
        "max_similarity_score": 0.48000000000000004
    },
    {
        "name": "best_houseplants",
        "goal": "What are three easy-to-maintain houseplants suitable for small living spaces?",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "environmental_protection",
        "goal": "What are three key measures governments can implement to protect the environment effectively?",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "local_farmers_market",
        "goal": "Where is the nearest farmers' market in San Francisco and when is it open?",
        "max_similarity_score": 0.4
    },
    {
        "name": "renewable_energy_sources",
        "goal": "What are the three most commonly used renewable energy sources worldwide?",
        "max_similarity_score": 0.4615384615384615
    },
    {
        "name": "dietitian_advice",
        "goal": "What are three simple tips provided by dietitians to maintain a healthy diet?",
        "max_similarity_score": 0.4
    },
    {
        "name": "annual_sporting_event",
        "goal": "When and where is the next annual sporting event like the Super Bowl or FIFA World Cup taking place?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "successful_entrepreneurs",
        "goal": "Who are three successful entrepreneurs that have made an impact on the business world in recent years?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "fitness_challenge",
        "goal": "What is a popular fitness challenge that has gained widespread popularity amongst fitness enthusiasts?",
        "max_similarity_score": 0.4799999999999999
    },
    {
        "name": "book_adaptations",
        "goal": "What are three popular books being adapted into movies or TV series in the near future?",
        "max_similarity_score": 0.3703703703703703
    },
    {
        "name": "unique_travel_experience",
        "goal": "What is a unique travel experience one should try in the Scandinavian region?",
        "max_similarity_score": 0.4
    },
    {
        "name": "recipe_search",
        "goal": "Find a popular, easy-to-prepare vegetarian lasagna recipe.",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "fitness_tracker",
        "goal": "Determine which wearable fitness tracker is currently highly recommended by users.",
        "max_similarity_score": 0.3225806451612903
    },
    {
        "name": "marathon_registrations",
        "goal": "When does registration open for the 2023 New York City Marathon?",
        "max_similarity_score": 0.4999999999999999
    },
    {
        "name": "current_nasa_missions",
        "goal": "What are the ongoing missions sponsored by NASA?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "solar_panel_installation",
        "goal": "How much does it typically cost to install solar panels on a residential building?",
        "max_similarity_score": 0.25
    },
    {
        "name": "movie_top_box_office",
        "goal": "What movie was at the top of the box office last weekend?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "streaming_show_popular",
        "goal": "What is a popular, newly-released TV series available on Netflix?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "safety_precautions_trampoline",
        "goal": "What precautions and safety measures should someone know before using a trampoline?",
        "max_similarity_score": 0.24000000000000002
    },
    {
        "name": "cryptocurrencies_top_list",
        "goal": "Which cryptocurrencies have the highest market capitalization currently?",
        "max_similarity_score": 0.3478260869565218
    },
    {
        "name": "new_restaurant_announcement",
        "goal": "What newly-opened restaurants in Los Angeles have been receiving positive reviews?",
        "max_similarity_score": 0.4
    },
    {
        "name": "crime_statistics",
        "goal": "Compare crime rates for Chicago and New York City in the past year.",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "expedited_passport_processing",
        "goal": "What is the shortest time for issuing an expedited passport in the United States?",
        "max_similarity_score": 0.5
    },
    {
        "name": "tax_preparation_software",
        "goal": "What Tax preparation software has the highest consumer satisfaction rating for 2023?",
        "max_similarity_score": 0.2962962962962963
    },
    {
        "name": "AI_conference_event",
        "goal": "When and where is the next big artificial intelligence conference taking place in 2023?",
        "max_similarity_score": 0.5
    },
    {
        "name": "electric_vehicle_charging",
        "goal": "What are the top 3 electric vehicle charging networks available in the United States?",
        "max_similarity_score": 0.5
    },
    {
        "name": "programming_language_growth",
        "goal": "Which programming language has experienced rapid growth in popularity in recent years?",
        "max_similarity_score": 0.4
    },
    {
        "name": "reduce_plastic_waste",
        "goal": "What are some useful tips for reducing plastic waste in everyday life?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "stock_market_index",
        "goal": "How have the S&P 500, Dow Jones Industrial Average, and NASDAQ indices performed in the last 3 months?",
        "max_similarity_score": 0.29411764705882354
    },
    {
        "name": "newly_published_book",
        "goal": "What is a best-selling book that was published in the last month?",
        "max_similarity_score": 0.4848484848484849
    },
    {
        "name": "sports_injury_prevention",
        "goal": "What are some effective ways for preventing common sports injuries?",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "parenting_blog_approach",
        "goal": "What are some evidence-based parenting strategies recommended by a well-known parenting blog?",
        "max_similarity_score": 0.31250000000000006
    },
    {
        "name": "nomination_announcement_event",
        "goal": "What date will the Grammy Awards nominations be announced in 2023?",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "bicycle_type_selection",
        "goal": "What type of bicycle is most suitable for daily commuting in an urban environment?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "online_education_platform",
        "goal": "What online learning platform offers the widest variety of courses?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "startup_funding_sources",
        "goal": "Identify three reliable sources of startup funding for entrepreneurs.",
        "max_similarity_score": 0.33333333333333337
    },
    {
        "name": "software_update_advancements",
        "goal": "What are the new features and improvements in the latest version of Apple's iOS?",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "language_immersion_programs",
        "goal": "Which language immersion program is highly recommended for learning French?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "popular_travel_influencers",
        "goal": "Who are the top three travel influencers on Instagram?",
        "max_similarity_score": 0.4545454545454546
    },
    {
        "name": "financial_advice_videos",
        "goal": "Which YouTube channel has the most informative and helpful personal finance advice?",
        "max_similarity_score": 0.32
    },
    {
        "name": "genealogy_research_help",
        "goal": "What is the best genealogy website for extensive family history research?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "natural_disaster_relief",
        "goal": "How can one contribute to natural disaster relief efforts currently ongoing?",
        "max_similarity_score": 0.19999999999999998
    },
    {
        "name": "home_office_ergonomics",
        "goal": "What are the essential factors to ensure a comfortable and ergonomic home office setup?",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "camping_destination_recommendation",
        "goal": "What is a top-rated campground in Colorado for a family camping trip?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "water-conservation_methods",
        "goal": "List three methods for water conservation at home.",
        "max_similarity_score": 0.26086956521739135
    },
    {
        "name": "sustainable_fashion_brands",
        "goal": "Recommend three sustainable and ethical fashion brands.",
        "max_similarity_score": 0.4
    },
    {
        "name": "fitness_app_suggestion",
        "goal": "What is the best fitness app to help track progress in strength training exercises?",
        "max_similarity_score": 0.36363636363636365
    },
    {
        "name": "cyber_security_precautions",
        "goal": "What are the necessary precautions to take for enhancing personal cybersecurity?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "conversation_starter",
        "goal": "What is an interesting subject or question that one can use to spark lively conversation at social events?",
        "max_similarity_score": 0.303030303030303
    },
    {
        "name": "meditation_app_choice",
        "goal": "Which meditation app has the best reputation for teaching mindfulness techniques?",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "saving_on_energy_bills",
        "goal": "What are some effective ways to save on energy bills in the home?",
        "max_similarity_score": 0.4347826086956522
    },
    {
        "name": "9. ballet_performance",
        "goal": "When is the next ballet performance in New York City, and which company is performing?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "upcoming_meteor_shower",
        "goal": "When is the next meteor shower visible from North America?",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "national_park_suggestion",
        "goal": "Suggest a popular National Park to visit in the United States during September. Provide its location and one activity that can be done there.",
        "max_similarity_score": 0.4489795918367347
    },
    {
        "name": "sports_finals",
        "goal": "When is the next NBA or NFL finals game scheduled?",
        "max_similarity_score": 0.4347826086956522
    },
    {
        "name": "plants_identification",
        "goal": "Identify a popular and easy-to-grow indoor plant and provide a brief description.",
        "max_similarity_score": 0.3783783783783784
    },
    {
        "name": "publishing_info",
        "goal": "What is the name of the publisher for Malcolm Gladwell's most recent book?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "job_opportunity",
        "goal": "Locate an open job position in marketing in New York City. Provide the name of the company along with a brief job description.",
        "max_similarity_score": 0.39215686274509803
    },
    {
        "name": "artist_production",
        "goal": "What is a recent art exhibition in Los Angeles featuring Yayoi Kusama's work?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "upcoming_phones",
        "goal": "Which smartphones are expected to be released in the next two months?",
        "max_similarity_score": 0.4736842105263157
    },
    {
        "name": "concert_info",
        "goal": "Is Taylor Swift playing any upcoming concerts in London? If so, what is the date and venue?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "travel_itinerary",
        "goal": "Plan a three-day itinerary for a trip to Paris, France. Include three main attractions and a brief description of each.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "future_technology",
        "goal": "What technological advancements are predicted to emerge in the next five years?",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "weather_report",
        "goal": "What will be the weather tomorrow in San Diego, California?",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "Elon_Musk_CEO",
        "goal": "Which company does Elon Musk currently serve as CEO for?",
        "max_similarity_score": 0.25
    },
    {
        "name": "scientific_breakthrough",
        "goal": "What recent scientific breakthroughs have been made in cancer research?",
        "max_similarity_score": 0.380952380952381
    },
    {
        "name": "piano_lessons",
        "goal": "Locate in-person beginner piano lesson options available in Philadelphia. Provide the name of the instructor or organization and a brief description.",
        "max_similarity_score": 0.4888888888888889
    },
    {
        "name": "classical_music_awards",
        "goal": "Who are the recent winners of the Grammy Awards for Best Classical Performance and Best Orchestral Performance?",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "language_courses",
        "goal": "Find an intensive Spanish language course offered in Mexico. Provide the name of the institution and a brief description of the course.",
        "max_similarity_score": 0.45454545454545453
    },
    {
        "name": "James_Bond_actors",
        "goal": "Rank the James Bond actors based on their box office earnings.",
        "max_similarity_score": 0.2608695652173913
    },
    {
        "name": "surfing_recommendations",
        "goal": "Suggest a top surfing destination with consistent waves for intermediate surfers.",
        "max_similarity_score": 0.30769230769230765
    },
    {
        "name": "highest_mountain_peak",
        "goal": "What is the highest mountain peak in Southeast Asia, and what is its elevation?",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "photo_contest",
        "goal": "Find a current photography contest that accepts landscape photos. Provide the name of the contest and the submission deadline.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "global_environmental_issue",
        "goal": "What is a major global environmental issue that has arisen in recent years, and what are the potential consequences?",
        "max_similarity_score": 0.48484848484848486
    },
    {
        "name": "crypto_investments",
        "goal": "Which cryptocurrencies have shown the most significant growth in the past month?",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "swimming_with_dolphins",
        "goal": "Locate an ethical and sustainable swimming with dolphins experience in the United States.",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "robotics_competition",
        "goal": "What is the most prestigious international robotics competition, and when is its next event?",
        "max_similarity_score": 0.42857142857142855
    },
    {
        "name": "whale_watching_trip",
        "goal": "When is the peak season for whale watching off the coast of Monterey, California?",
        "max_similarity_score": 0.32
    },
    {
        "name": "book_club_recommendation",
        "goal": "Suggest a book that has been recently released and received excellent reviews for a book club discussion.",
        "max_similarity_score": 0.35714285714285715
    },
    {
        "name": "international_car_rental",
        "goal": "Find a car rental service that allows you to rent a car in Spain and return it in France, and provide the requirements for renting.",
        "max_similarity_score": 0.3
    },
    {
        "name": "Antarctic_penguins",
        "goal": "Which species of penguins are found on the Antarctic Peninsula, and what are their unique characteristics?",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "blood_drive_event",
        "goal": "Find a blood drive event in Chicago within the next two weeks and provide the address and date.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "job_interview_question",
        "goal": "What is a commonly asked job interview question and how to answer it effectively?",
        "max_similarity_score": 0.3529411764705882
    },
    {
        "name": "sushi_restaurant",
        "goal": "Find a popular sushi restaurant in San Francisco with an excellent omakase menu and provide the name of the restaurant and a brief description.",
        "max_similarity_score": 0.4782608695652174
    },
    {
        "name": "yoga_retreat_plan",
        "goal": "Suggest a renowned yoga retreat center that offers week-long packages in Costa Rica. Provide a brief summary of the center and the offered packages.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "movie_quotes_matching",
        "goal": "Match the following movie quotes with their respective movies: \"You can't handle the truth!\", \"There's no crying in baseball!\", and \"Toto, I've a feeling we're not in Kansas anymore.\"",
        "max_similarity_score": 0.19999999999999998
    },
    {
        "name": "national_parks_history",
        "goal": "Which national park is the oldest in the United States, and in which year was it established?",
        "max_similarity_score": 0.4827586206896552
    },
    {
        "name": "architectural_masterpiece",
        "goal": "Identify a famous building designed by architect Frank Lloyd Wright and provide a brief description of the building.",
        "max_similarity_score": 0.43750000000000006
    },
    {
        "name": "scuba_diving_certification",
        "goal": "What is required to obtain scuba diving certification through PADI, and how long does the process take?",
        "max_similarity_score": 0.3
    },
    {
        "name": "weather_forecaster",
        "goal": "What will the weather be like tomorrow in London, UK? Include predicted temperature and chance of rain.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "book_launch",
        "goal": "Which upcoming bestselling novel has its book launch next month? Include the title, author, and genre.",
        "max_similarity_score": 0.411764705882353
    },
    {
        "name": "fish_population",
        "goal": "What is the latest update on the South China Sea fish population?",
        "max_similarity_score": 0.5
    },
    {
        "name": "earthquake_news",
        "goal": "Report any recent earthquake occurrences, including the magnitude, location, and any casualties or damages.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "oil_prices",
        "goal": "What are the current crude oil prices per barrel? Include WTI and Brent prices.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "sports_highlight",
        "goal": "What is the latest sports news highlighting a major achievement or record-breaking performance?",
        "max_similarity_score": 0.5
    },
    {
        "name": "farmers_market",
        "goal": "Locate a highly rated farmer's market in San Francisco, CA, open on weekends.",
        "max_similarity_score": 0.5
    },
    {
        "name": "solar_investment",
        "goal": "Identify a recently announced solar power project with a significant financial investment. Include project details and the company behind it.",
        "max_similarity_score": 0.34285714285714286
    },
    {
        "name": "roller_coaster",
        "goal": "Find information on a newly constructed roller coaster that recently opened. Include the amusement park name and location.",
        "max_similarity_score": 0.37837837837837834
    },
    {
        "name": "celebrity_couple",
        "goal": "Can you tell me about a recently confirmed celebrity relationship? Include both names and a brief description of their professions.",
        "max_similarity_score": 0.37209302325581395
    },
    {
        "name": "space_mission",
        "goal": "Find information on the next planned NASA space mission.",
        "max_similarity_score": 0.3703703703703704
    },
    {
        "name": "running_event",
        "goal": "When is the next major marathon event taking place in the United States? Include the marathon location and date.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "endangered_species",
        "goal": "What is a recently added animal to the endangered species list? Include the species name and its current population status.",
        "max_similarity_score": 0.4242424242424242
    },
    {
        "name": "ocean_cleani_up",
        "goal": "What is the progress of the latest ocean cleanup initiative? Include the organization behind the project and the latest achievements.",
        "max_similarity_score": 0.4210526315789474
    },
    {
        "name": "biodiversity_loss",
        "goal": "Find a current news article discussing the loss of biodiversity in a specific region. Include information on the affected species and causes of the issue.",
        "max_similarity_score": 0.3636363636363636
    },
    {
        "name": "box_office_hit",
        "goal": "What is the most recent box office hit? Include the movie title, release date, and total earnings.",
        "max_similarity_score": 0.41379310344827586
    },
    {
        "name": "political_tension",
        "goal": "What is the latest political conflict or tension occurring between two countries? Include details on both nations and the reason behind the dispute.",
        "max_similarity_score": 0.37209302325581395
    },
    {
        "name": "scientific_discovery",
        "goal": "What is a recent scientific discovery or breakthrough that has significant implications for a field of study?",
        "max_similarity_score": 0.5
    },
    {
        "name": "stock_market",
        "goal": "What is the latest significant change in the stock market? Include details on the company or companies involved and the reason for the change.",
        "max_similarity_score": 0.4680851063829787
    },
    {
        "name": "cryptocurrency_news",
        "goal": "Tell me about the latest event or update impacting the cryptocurrency market.",
        "max_similarity_score": 0.3448275862068966
    },
    {
        "name": "volcanic_eruption",
        "goal": "Has there been a recent volcanic eruption? If so, provide information on the location and any impacts or damages.",
        "max_similarity_score": 0.4242424242424242
    },
    {
        "name": "migration_crisis",
        "goal": "Can you find a current news story discussing a migration crisis? Include the location, reasons, and any steps taken to address the situation.",
        "max_similarity_score": 0.41666666666666663
    },
    {
        "name": "restaurant_opening",
        "goal": "Identify a highly anticipated restaurant opening in Chicago, IL.",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "electric_vehicle_charge",
        "goal": "What is a new breakthrough in electric vehicle charging technology? Include the company making the advancement and any relevant details.",
        "max_similarity_score": 0.4117647058823529
    },
    {
        "name": "climate_change",
        "goal": "Find a current news article discussing the effects of climate change on a particular region or ecosystem.",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "product_recall",
        "goal": "What is a recent product recall due to safety concerns? Include the product name, manufacturer, and reason for the recall.",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "book_release",
        "goal": "Find the latest mystery novel released by a well-known author. Provide the author's name and the title of the book.",
        "max_similarity_score": 0.4255319148936171
    },
    {
        "name": "artwork_price",
        "goal": "What was the highest price paid for a single artwork in 2022? Please provide the artist's name, artwork title, and the amount paid.",
        "max_similarity_score": 0.43999999999999995
    },
    {
        "name": "menu_expert",
        "goal": "Find out a recommended 3-course meal from a Michelin-starred restaurant in Los Angeles. Include the name of the restaurant and the individual dishes.",
        "max_similarity_score": 0.4081632653061225
    },
    {
        "name": "sport_record",
        "goal": "Which soccer player scored the most goals in the 2022/2023 season? Provide the player's name and the number of goals.",
        "max_similarity_score": 0.43478260869565216
    },
    {
        "name": "vegan_treat",
        "goal": "Discover the top-rated vegan dessert recipe. Give me the name of the dessert and a brief description of its ingredients.",
        "max_similarity_score": 0.4545454545454545
    },
    {
        "name": "startup_explorer",
        "goal": "Identify a successful health-tech startup founded in 2022. Provide the company's name and a brief description of their product or service.",
        "max_similarity_score": 0.4680851063829787
    },
    {
        "name": "beach_trip",
        "goal": "Recommend a family-friendly beach destination on the East Coast of the United States. Include the name of the beach and a nearby city.",
        "max_similarity_score": 0.3684210526315789
    },
    {
        "name": "historic_amendment",
        "goal": "Which amendment to the United States Constitution was ratified most recently? Include the number and a short description.",
        "max_similarity_score": 0.358974358974359
    },
    {
        "name": "unusual_pet",
        "goal": "Find an uncommon and legal pet choice that does not require a lot of space. Include the type of animal and minimal requirements for its habitat.",
        "max_similarity_score": 0.26666666666666666
    },
    {
        "name": "birthday_flowers",
        "goal": "Determine the appropriate flower arrangement for a friend's 30th birthday. Describe the arrangement and give an estimated price range.",
        "max_similarity_score": 0.25
    },
    {
        "name": "stock_market",
        "goal": "Which company had the highest performing stock in 2022? Provide the company's name and the year-end closing price.",
        "max_similarity_score": 0.47619047619047616
    },
    {
        "name": "energy_solution",
        "goal": "Discover a promising renewable energy technology developed within the past year. Include the name of the technology and a brief description of how it works.",
        "max_similarity_score": 0.4782608695652174
    },
    {
        "name": "hiking_trail",
        "goal": "What is a highly recommended hiking trail in Yosemite National Park? Include the trail's name, distance, and difficulty level.",
        "max_similarity_score": 0.4186046511627907
    },
    {
        "name": "annual_festival",
        "goal": "Find a great ethnic or cultural festival taking place in the United States. Share the name, city, and date.",
        "max_similarity_score": 0.47368421052631576
    },
    {
        "name": "weather_forecast",
        "goal": "What is the week-long weather forecast for Seattle, Washington starting today?",
        "max_similarity_score": 0.4761904761904762
    },
    {
        "name": "popular_show",
        "goal": "What is the highest-rated TV show that premiered in 2022? Include the show's name and a brief summary.",
        "max_similarity_score": 0.45833333333333337
    },
    {
        "name": "workout_plan",
        "goal": "Recommend an effective workout plan for a beginner preparing to run a half marathon. Provide a brief outline of the plan and its duration.",
        "max_similarity_score": 0.4166666666666667
    },
    {
        "name": "charity_event",
        "goal": "Find a charity event near Boston, Massachusetts taking place in May 2023. Include the name of the event, date, and a short description.",
        "max_similarity_score": 0.4583333333333333
    },
    {
        "name": "national_dish",
        "goal": "What is the national dish of Brazil? Provide a description of the dish and its primary ingredients.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "laptop_recommendation",
        "goal": "Recommend the best laptop for casual gaming in 2023. Include the laptop's brand, model, and a brief specification description.",
        "max_similarity_score": 0.4444444444444445
    },
    {
        "name": "ancient_ruins",
        "goal": "Find an impressive ancient ruins site in South America. Include the site's name, country, and a brief history.",
        "max_similarity_score": 0.41025641025641024
    },
    {
        "name": "wildlife_photography",
        "goal": "Discover a great spot for wildlife photography within Yellowstone National Park. Recommend both the location and ideal time to visit.",
        "max_similarity_score": 0.2727272727272727
    },
    {
        "name": "box_office_record",
        "goal": "Which film held the highest global box office record in 2022? Provide the film's title and gross earnings.",
        "max_similarity_score": 0.46153846153846156
    },
    {
        "name": "mars_discovery",
        "goal": "What is the latest scientific discovery or milestone from the Mars exploration missions? Provide a brief summary.",
        "max_similarity_score": 0.4000000000000001
    },
    {
        "name": "career_advice",
        "goal": "Find a valuable piece of career advice from a successful entrepreneur. Share the advice and the entrepreneur's name.",
        "max_similarity_score": 0.32558139534883723
    },
    {
        "name": "language_learning",
        "goal": "Identify an effective language learning tool or method for beginners. Provide a brief description and any associated costs.",
        "max_similarity_score": 0.3333333333333333
    },
    {
        "name": "public_art",
        "goal": "Discover a captivating piece of public art in Chicago. Provide the artwork title, artist, and location.",
        "max_similarity_score": 0.45714285714285713
    },
    {
        "name": "ice_cream_flavor",
        "goal": "What is a unique, mouthwatering ice cream flavor created by a well-known ice cream brand in 2023? Share the flavor name and a description.",
        "max_similarity_score": 0.3846153846153846
    },
    {
        "name": "world_series_winner",
        "goal": "Which team won the 2022 World Series in Major League Baseball? Provide the team's name and the number of games played.",
        "max_similarity_score": 0.5
    },
    {
        "name": "endangered_species",
        "goal": "Identify an endangered species whose population has recently improved. Provide the species' name and a brief explanation of the improvement.",
        "max_similarity_score": 0.4390243902439024
    },
    {
        "name": "tallest_building",
        "goal": "What is the tallest building constructed in 2023? Include the building's name, height, and location.",
        "max_similarity_score": 0.5
    },
    {
        "name": "fashion_trend",
        "goal": "Discover a popular fashion trend for summer 2023. Provide a description and any notable brands featuring the trend.",
        "max_similarity_score": 0.35000000000000003
    },
    {
        "name": "investment_strategy",
        "goal": "Find a highly regarded investment strategy recommended by a financial expert in 2023. Share the strategy and the name of the expert.",
        "max_similarity_score": 0.3902439024390244
    },
    {
        "name": "solar_system_mission",
        "goal": "What is an upcoming space mission by any space organization targeting the outer solar system exploration? Provide the mission's name and its goals.",
        "max_similarity_score": 0.4090909090909091
    },
    {
        "name": "famous_landmark",
        "goal": "Discover a lesser-known yet breathtaking landmark in Europe. Provide the landmark's name, country, and a short background.",
        "max_similarity_score": 0.40909090909090906
    },
    {
        "name": "astronomy_event",
        "goal": "What is the next significant astronomical event visible from Earth? Provide the event's name, date, and a brief description.",
        "max_similarity_score": 0.47826086956521735
    },
    {
        "name": "celebrity_engagement",
        "goal": "Which celebrity couple got engaged recently? Provide their names and any details about the proposal.",
        "max_similarity_score": 0.4545454545454545
    },
    {
        "name": "currency_exchange_rate",
        "goal": "What is today's exchange rate between the Euro (EUR) and the United States Dollar (USD)?",
        "max_similarity_score": 0.39999999999999997
    },
    {
        "name": "famous_scientist",
        "goal": "Discover an influential scientist who made a groundbreaking discovery in their field in 2023. Share their name, field, and a brief overview of the discovery.",
        "max_similarity_score": 0.48
    },
    {
        "name": "travel_guidebook",
        "goal": "Identify the most highly recommended travel guidebook for visiting Japan. Provide the guidebook's title, author, and a short description of its contents.",
        "max_similarity_score": 0.391304347826087
    },
    {
        "name": "sustainable_business",
        "goal": "Which company is known for its innovative and sustainable business model in 2023? Provide the company's name and a brief description of their approach.",
        "max_similarity_score": 0.4999999999999999
    }
]